{
    "catalog": {
      "id": "uuid-5a1fef9f-e95c-46ee-9c84-0e59c48e9d13",
      "metadata": {
        "title": "NIST Special Publication 800-171 Revision 1: Protecting Controlled Unclassified Information in Nonfederal Systems and Organizations",
        "last-modified": "2018-06-07-04T14:55:16.051-05:00",
        "version": "2018-06-07",
        "oscal-version": "1.0.0-milestone3",
        "properties": [
          {
            "name": "keywords",
            "value": "Assurance, computer security, FISMA, Privacy Act, Risk Management Framework, security controls, security requirements"
          }
        ],
        "links": [
          {
            "href": "#resource-pdf-sp-800-171r1",
            "rel": "alternate",
            "text": "NIST publication (PDF)"
          },
          {
            "href": "#resource-doi-sp-800-171r1",
            "rel": "canonical",
            "text": "NIST publication via DOI lookup"
          }
        ],
        "roles": [
          {
            "id": "creator",
            "title": "Document creator"
          },
          {
            "id": "contact",
            "title": "Contact"
          }
        ],
        "parties": [
          {
            "id": "IT-JTF",
            "org": {
              "org-name": "Joint Task Force, Transformation Initiative",
              "addresses": [
                {
                  "postal-address": [
                    "National Institute of Standards and Technology",
                    "Attn: Computer Security Division",
                    "Information Technology Laboratory",
                    "100 Bureau Drive (Mail Stop 8930)"
                  ],
                  "city": "Gaithersburg",
                  "state": "MD",
                  "postal-code": "20899-8930"
                }
              ],
              "email-addresses": [
                "sec-cert@nist.gov"
              ]
            }
          }
        ],
        "responsible-parties": {
          "creator": {
            "party-ids": [
              "IT-JTF"
            ]
          },
          "contact": {
            "party-ids": [
              "IT-JTF"
            ]
          }
        }
      },
      "groups": [
        {
          "id": "c3.1",
          "class": "family",
          "title": "Access Control",
          "controls": [
            {
              "id": "c3.1.1",
              "class": "SP800-171",
              "title": "Limit system access to authorized users, processes acting on behalf of authorized users, and devices (including other systems).",
              "parameters": [],
              "properties": [
                {
                  "name": "label",
                  "value": "3.1.1"
                },
                {
                  "name": "sort-id",
                  "value": "03.01.01"
                }
              ],
              "links": [],
              "parts": [
                {
                  "id": "c3.1.1_smt",
                  "name": "statement",
                  "prose": "Limit system access to authorized users, processes acting on behalf of authorized users, and devices (including other system).",
                  "parts": []
                },
                {
                  "id": "c3.1.1_gdn",
                  "name": "guidance",
                  "prose": "Access control policies (e.g., identity- or role-based policies, control matrices, and cryptography) control access between active entities or subjects (i.e., users or processes acting on behalf of users) and passive entities or objects (e.g., devices, files, records, and domains) in systems. Access enforcement mechanisms can be employed at the application and service level to provide increased information security. Other systems include systems internal and external to the organization. This requirement focuses on account management for both systems and applications. The definition of and enforcement of access authorizations, other than those determined by account type (e.g., privileged verses non-privileged) are addressed in requirement 3.1.2.",
                  "links": [
                    {
                      "href": "#3.1.2",
                      "rel": "reference",
                      "text": "3.1.2"
                    }
                  ]
                }
              ]
            },
            {
              "id": "c3.1.2",
              "class": "SP800-171",
              "title": "Limit system access to the types of transactions and functions that authorized users are permitted to execute.",
              "parameters": [],
              "properties": [
                {
                  "name": "label",
                  "value": "3.1.2"
                },
                {
                  "name": "sort-id",
                  "value": "03.01.02"
                }
              ],
              "links": [],
              "parts": [
                {
                  "id": "c3.1.2_smt",
                  "name": "statement",
                  "prose": "Limit system access to the types of transactions and functions that authorized users are permitted to execute.",
                  "parts": []
                },
                {
                  "id": "c3.1.2_gdn",
                  "name": "guidance",
                  "prose": "Organizations may choose to define access privileges or other attributes by account, by type of account, or a combination of both. System account types include, for example, individual, shared, group, system, guest/anonymous, emergency, developer/manufacturer/vendor, and temporary. Other attributes required for authorizing access include, for example: restrictions on time-of-day, day-of-week, and point-of-origin. In defining other account attributes, organizations may consider system-related requirements (e.g., scheduled maintenance, system upgrades) and mission or business requirements, (e.g., time zone differences, customer requirements, remote access to support travel requirements).",
                  "links": [
                    {
                      "href": "",
                      "rel": "",
                      "text": ""
                    }
                  ]
                }
              ]
            },
            {
              "id": "c3.1.3",
              "class": "SP800-171",
              "title": "Control the flow of CUI in accordance with approved authorizations.",
              "parameters": [],
              "properties": [
                {
                  "name": "label",
                  "value": "3.1.3"
                },
                {
                  "name": "sort-id",
                  "value": "03.01.03"
                }
              ],
              "links": [],
              "parts": [
                {
                  "id": "c3.1.3_smt",
                  "name": "statement",
                  "prose": "Control the flow of CUI in accordance with approved authorizations.",
                  "parts": []
                },
                {
                  "id": "c3.1.3_gdn",
                  "name": "guidance",
                  "prose": "Information flow control regulates where information can travel within a system and between systems (as opposed to who can access the information) and without explicit regard to subsequent accesses to that information. Flow control restrictions include, for example: keeping export- controlled information from being transmitted in the clear to the Internet; blocking outside traffic that claims to be from within the organization; restricting requests to the Internet that are not from the internal web proxy server; and limiting information transfers between organizations based on data structures and content.\n\nOrganizations commonly employ information flow control policies and enforcement mechanisms to control the flow of information between designated sources and destinations (e.g., networks, individuals, and devices) within systems and between interconnected systems. Flow control is based on characteristics of the information or the information path. Enforcement occurs in boundary protection devices (e.g., gateways, routers, guards, encrypted tunnels, firewalls) that employ rule sets or establish configuration settings that restrict system services, provide a packet- filtering capability based on header information, or message-filtering capability based on message content (e.g., implementing key word searches or using document characteristics). Organizations also consider the trustworthiness of filtering and inspection mechanisms (i.e., hardware, firmware, and software components) that are critical to information flow enforcement.\n\nTransferring information between systems representing different security domains with different security policies introduces risk that such transfers violate one or more domain security policies. In such situations, information owners/stewards provide guidance at designated policy enforcement points between interconnected systems. Organizations consider mandating specific architectural solutions when required to enforce specific security policies. Enforcement includes, for example: prohibiting information transfers between interconnected systems (i.e., allowing access only); employing hardware mechanisms to enforce one-way information flows; and implementing trustworthy regrading mechanisms to reassign security attributes and security labels.",
                  "links": [
                    {
                      "href": "",
                      "rel": "",
                      "text": ""
                    }
                  ]
                }
              ]
            },
            {
              "id": "c3.1.4",
              "class": "SP800-171",
              "title": "Separate the duties of individuals to reduce the risk of malevolent activity without collusion.",
              "parameters": [],
              "properties": [
                {
                  "name": "label",
                  "value": "3.1.4"
                },
                {
                  "name": "sort-id",
                  "value": "03.01.03"
                }
              ],
              "links": [],
              "parts": [
                {
                  "id": "c3.1.4_smt",
                  "name": "statement",
                  "prose": "Separate the duties of individuals to reduce the risk of malevolent activity without collusion.",
                  "parts": []
                },
                {
                  "id": "c3.1.4_gdn",
                  "name": "guidance",
                  "prose": "Separation of duties addresses the potential for abuse of authorized privileges and helps to reduce the risk of malevolent activity without collusion. Separation of duties includes, for example: dividing mission functions and system support functions among different individuals or roles; conducting system support functions with different individuals (e.g., system management, programming, configuration management, quality assurance and testing, and network security); and ensuring that security personnel administering access control functions do not also administer audit functions. Because separation of duty violations can span systems and application domains, organizations consider the entirety of organizational systems and system components when developing policy on separation of duties.",
                  "links": [
                    {
                      "href": "",
                      "rel": "",
                      "text": ""
                    }
                  ]
                }
              ]
            },
            {
              "id": "c3.1.5",
              "class": "SP800-171",
              "title": "Employ the principle of least privilege, including for specific security functions and privileged accounts.",
              "parameters": [],
              "properties": [
                {
                  "name": "label",
                  "value": "3.1.5"
                },
                {
                  "name": "sort-id",
                  "value": "03.01.05"
                }
              ],
              "links": [],
              "parts": [
                {
                  "id": "c3.1.5_smt",
                  "name": "statement",
                  "prose": "Employ the principle of least privilege, including for specific security functions and privileged accounts.",
                  "parts": []
                },
                {
                  "id": "c3.1.5_gdn",
                  "name": "guidance",
                  "prose": "Organizations employ the principle of least privilege for specific duties and authorized accesses for users and processes. The principle of least privilege is applied with the goal of authorized privileges no higher than necessary to accomplish required organizational missions or business functions. Organizations consider the creation of additional processes, roles, and system accounts as necessary, to achieve least privilege. Organizations also apply least privilege to the development, implementation, and operation of organizational systems. Security functions include, for example, establishing system accounts, setting events to be logged, setting intrusion detection parameters, and configuring access authorizations (i.e., permissions, privileges).\n\nPrivileged accounts, including super user accounts, are typically described as system administrator for various types of commercial off-the-shelf operating systems. Restricting privileged accounts to specific personnel or roles prevents day-to-day users from having access to privileged information or functions. Organizations may differentiate in the application of this requirement between allowed privileges for local accounts and for domain accounts provided organizations retain the ability to control system configurations for key security parameters and as otherwise necessary to sufficiently mitigate risk.",
                  "links": [
                    {
                      "href": "",
                      "rel": "",
                      "text": ""
                    }
                  ]
                }
              ]
            },
            {
              "id": "c3.1.6",
              "class": "SP800-171",
              "title": "Use non-privileged accounts or roles when accessing nonsecurity functions.",
              "parameters": [],
              "properties": [
                {
                  "name": "label",
                  "value": "3.1.6"
                },
                {
                  "name": "sort-id",
                  "value": "03.01.06"
                }
              ],
              "links": [],
              "parts": [
                {
                  "id": "c3.1.6_smt",
                  "name": "statement",
                  "prose": "Use non-privileged accounts or roles when accessing nonsecurity functions.",
                  "parts": []
                },
                {
                  "id": "c3.1.6_gdn",
                  "name": "guidance",
                  "prose": "This requirement limits exposure when operating from within privileged accounts or roles. The inclusion of roles addresses situations where organizations implement access control policies such as role-based access control and where a change of role provides the same degree of assurance in the change of access authorizations for the user and all processes acting on behalf of the user as would be provided by a change between a privileged and non-privileged account.",
                  "links": [
                    {
                      "href": "",
                      "rel": "",
                      "text": ""
                    }
                  ]
                }
              ]
            },
            {
              "id": "c3.1.7",
              "class": "SP800-171",
              "title": "Prevent non-privileged users from executing privileged functions and capture the execution of such functions in audit logs.",
              "parameters": [],
              "properties": [
                {
                  "name": "label",
                  "value": "3.1.7"
                },
                {
                  "name": "sort-id",
                  "value": "03.01.07"
                }
              ],
              "links": [],
              "parts": [
                {
                  "id": "c3.1.7_smt",
                  "name": "statement",
                  "prose": "Prevent non-privileged users from executing privileged functions and capture the execution of such functions in audit logs.",
                  "parts": []
                },
                {
                  "id": "c3.1.7_gdn",
                  "name": "guidance",
                  "prose": "Privileged functions include, for example, establishing system accounts, performing system integrity checks, conducting patching operations, or administering cryptographic key management activities. Non-privileged users are individuals that do not possess appropriate authorizations. Circumventing intrusion detection and intrusion prevention mechanisms or malicious code protection mechanisms are examples of privileged functions that require protection from non-privileged users. Note that this requirement represents a condition to be achieved by the definition of authorized privileges in 3.1.2.\n\nMisuse of privileged functions, either intentionally or unintentionally by authorized users, or by unauthorized external entities that have compromised system accounts, is a serious and ongoing concern and can have significant adverse impacts on organizations. Logging the use of privileged functions is one way to detect such misuse, and in doing so, help mitigate the risk from insider threats and the advanced persistent threat.",
                  "links": [
                    {
                      "href": "#3.1.2",
                      "rel": "reference",
                      "text": "3.1.2"
                    }
                  ]
                }
              ]
            },
            {
              "id": "c3.1.8",
              "class": "SP800-171",
              "title": "Limit unsuccessful logon attempts.",
              "parameters": [],
              "properties": [
                  {
                      "name": "label",
                      "value": "3.1.8"
                  },
                  {
                      "name": "sort-id",
                      "value": "3.1.8"
                  }
              ],
              "links": [],
              "parts": [
                  {
                      "id": "c3.1.8_smt",
                      "name": "statement",
                      "prose": "Limit unsuccessful logon attempts.",
                      "parts": []
                  },
                  {
                      "id": "c3.1.8_gdn",
                      "name": "guidance",
                      "prose": "This requirement applies regardless of whether the logon occurs via a local or network connection. Due to the potential for denial of service, automatic lockouts initiated by systems are, in most cases, temporary and automatically release after a predetermined period established by the organization (i.e., a delay algorithm). If a delay algorithm is selected, organizations may employ different algorithms for different system components based on the capabilities of the respective components. Responses to unsuccessful logon attempts may be implemented at the operating system and the application levels.",
                      "links": [
                          {
                              "href": "#ID",
                              "rel": "reference",
                              "text": "3.1.8"
                          }
                      ]
                  }
              ]
            },
            {
                "id": "c3.1.10",
                "class": "SP800-171",
                "title": "Use session lock with pattern-hiding displays to prevent access and viewing of data after a period of inactivity.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.1.10"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.1.10"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.1.10_smt",
                        "name": "statement",
                        "prose": "Use session lock with pattern-hiding displays to prevent access and viewing of data after a period of inactivity.",
                        "parts": []
                    },
                    {
                        "id": "c3.1.10_gdn",
                        "name": "guidance",
                        "prose": "Session locks are temporary actions taken when users stop work and move away from the immediate vicinity of the system but do not want to log out because of the temporary nature of their absences. Session locks are implemented where session activities can be determined, typically at the operating system level (but can also be at the application level). Session locks are not an acceptable substitute for logging out of the system, for example, if organizations require users to log out at the end of the workday.\\n\\nPattern-hiding displays can include static or dynamic images, for example, patterns used with screen savers, photographic images, solid colors, clock, battery life indicator, or a blank screen, with the additional caveat that none of the images convey controlled unclassified information.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.1.10"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.1.11",
                "class": "SP800-171",
                "title": "Terminate (automatically) a user session after a defined condition.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.1.11"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.1.11"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.1.11_smt",
                        "name": "statement",
                        "prose": "Terminate (automatically) a user session after a defined condition.",
                        "parts": []
                    },
                    {
                        "id": "c3.1.11_gdn",
                        "name": "guidance",
                        "prose": "This requirement addresses the termination of user-initiated logical sessions in contrast to the termination of network connections that are associated with communications sessions (i.e., disconnecting from the network). A logical session (for local, network, and remote access) is initiated whenever a user (or process acting on behalf of a user) accesses an organizational system. Such user sessions can be terminated (and thus terminate user access) without terminating network sessions. Session termination terminates all processes associated with a user’s logical session except those processes that are specifically created by the user (i.e., session owner) to continue after the session is terminated. Conditions or trigger events requiring automatic session termination can include, for example, organization-defined periods of user inactivity, targeted responses to certain types of incidents, and time-of-day restrictions on system use.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.1.11"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.1.12",
                "class": "SP800-171",
                "title": "Monitor and control remote access sessions.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.1.12"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.1.12"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.1.12_smt",
                        "name": "statement",
                        "prose": "Monitor and control remote access sessions.",
                        "parts": []
                    },
                    {
                        "id": "c3.1.12_gdn",
                        "name": "guidance",
                        "prose": "Remote access is access to organizational systems by users (or processes acting on behalf of users) communicating through external networks (e.g., the Internet). Remote access methods include, for example: dial-up, broadband, and wireless. Organizations often employ encrypted virtual private networks (VPNs) to enhance confidentiality over remote connections. The use of encrypted VPNs does not make the access non-remote; however, the use of VPNs, when adequately provisioned with appropriate safeguards (e.g., employing encryption techniques for confidentiality protection), may provide sufficient assurance to the organization that it can effectively treat such connections as internal networks. VPNs with encrypted tunnels can affect the capability to adequately monitor network communications traffic for malicious code.\\n\\nAutomated monitoring and control of remote access sessions allows organizations to detect cyber- attacks and help to ensure ongoing compliance with remote access policies by auditing connection activities of remote users on a variety of system components (e.g., servers, workstations, notebook computers, smart phones, and tablets).\\n\\nNIST Special Publications 800-46, 800-77, and 800-113 provide guidance on secure remote access and virtual private networks.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.1.12"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.1.13",
                "class": "SP800-171",
                "title": "Employ cryptographic mechanisms to protect the confidentiality of remote access sessions.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.1.13"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.1.13"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.1.13_smt",
                        "name": "statement",
                        "prose": "Employ cryptographic mechanisms to protect the confidentiality of remote access sessions.",
                        "parts": []
                    },
                    {
                        "id": "c3.1.13_gdn",
                        "name": "guidance",
                        "prose": "Generally applicable cryptographic standards include FIPS-validated cryptography and NSA- approved cryptography.\nSee NIST Cryptographic Standards; NIST Cryptographic Module Validation Program; NIST Cryptographic Algorithm Validation Program; NSA Cryptographic Standards.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.1.13"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.1.14",
                "class": "SP800-171",
                "title": "Route remote access via managed access control points.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.1.14"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.1.14"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.1.14_smt",
                        "name": "statement",
                        "prose": "Route remote access via managed access control points.",
                        "parts": []
                    },
                    {
                        "id": "c3.1.14_gdn",
                        "name": "guidance",
                        "prose": "Routing all remote access through managed access control points enhances explicit, organizational control over such connections, reducing the susceptibility to unauthorized access to organizational systems resulting in the unauthorized disclosure of CUI.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.1.14"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.1.15",
                "class": "SP800-171",
                "title": "Authorize remote execution of privileged commands and remote access to security-relevant information.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.1.15"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.1.15"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.1.15_smt",
                        "name": "statement",
                        "prose": "Authorize remote execution of privileged commands and remote access to security-relevant information.",
                        "parts": []
                    },
                    {
                        "id": "c3.1.15_gdn",
                        "name": "guidance",
                        "prose": "A privileged command is a human-initiated (interactively or via a process operating on behalf of the human) command executed on a system involving the control, monitoring, or administration of the system including security functions and associated security-relevant information. Security-relevant information is any information within the system that can potentially impact the operation of security functions or the provision of security services in a manner that could result in failure to enforce the system security policy or maintain isolation of code and data. Privileged commands give individuals the ability to execute sensitive, security-critical, or security-relevant system functions. Controlling such access from remote locations helps to ensure that unauthorized individuals are not able to execute such commands freely with the potential to do serious or catastrophic damage to organizational systems. Note that the ability to affect the integrity of the system is considered security-relevant as that could enable the means to by-pass security functions although not directly impacting the function itself.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.1.15"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.1.16",
                "class": "SP800-171",
                "title": "Authorize wireless access prior to allowing such connections.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.1.16"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.1.16"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.1.16_smt",
                        "name": "statement",
                        "prose": "Authorize wireless access prior to allowing such connections.",
                        "parts": []
                    },
                    {
                        "id": "c3.1.16_gdn",
                        "name": "guidance",
                        "prose": "Establishing usage restrictions and configuration/connection requirements for wireless access to the system provides criteria for organizations to support wireless access authorization decisions. Such restrictions and requirements reduce the susceptibility to unauthorized access to the system through wireless technologies. Wireless networks use authentication protocols which provide credential protection and mutual authentication.\\n\\nNIST Special Publications 800-48 and 800-97 provide guidance on secure wireless networks.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.1.16"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.1.17",
                "class": "SP800-171",
                "title": "Protect wireless access using authentication and encryption.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.1.17"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.1.17"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.1.17_smt",
                        "name": "statement",
                        "prose": "Protect wireless access using authentication and encryption.",
                        "parts": []
                    },
                    {
                        "id": "c3.1.17_gdn",
                        "name": "guidance",
                        "prose": "Organizations can authenticate individuals and devices to help protect wireless access to the system. Special attention should be given to the wide variety of devices that are part of the Internet of Things with potential wireless access to organizational systems.\\n\\nSee NIST Cryptographic Standards.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.1.17"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.1.18",
                "class": "SP800-171",
                "title": "Control connection of mobile devices.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.1.18"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.1.18"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.1.18_smt",
                        "name": "statement",
                        "prose": "Control connection of mobile devices.",
                        "parts": []
                    },
                    {
                        "id": "c3.1.18_gdn",
                        "name": "guidance",
                        "prose": "A mobile device is a computing device that has a small form factor such that it can easily be carried by a single individual; is designed to operate without a physical connection (e.g., wirelessly transmit or receive information); possesses local, non-removable or removable data storage; and includes a self-contained power source. Mobile devices may also include voice communication capabilities, on-board sensors that allow the device to capture information, or built-in features for synchronizing local data with remote locations. Examples of mobile devices include smart phones, e-readers, and tablets.\nDue to the large variety of mobile devices with different technical characteristics and capabilities, organizational restrictions may vary for the different types of devices. Usage restrictions and implementation guidance for mobile devices include, for example: configuration management; device identification and authentication; implementation of mandatory protective software (e.g., malicious code detection, firewall); scanning devices for malicious code; updating virus protection software; scanning for critical software updates and patches; conducting primary operating system (and possibly other resident software) integrity checks; and disabling unnecessary hardware (e.g., wireless, infrared). The need to provide adequate security for mobile devices goes beyond this requirement. Many safeguards for mobile devices are reflected in other CUI security requirements.\\n\\nNIST Special Publication 800-124 provides guidance on mobile device security.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.1.18"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.1.19",
                "class": "SP800-171",
                "title": "Encrypt CUI on mobile devices and mobile computing platforms.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.1.19"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.1.19"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.1.19_smt",
                        "name": "statement",
                        "prose": "Encrypt CUI on mobile devices and mobile computing platforms.",
                        "parts": []
                    },
                    {
                        "id": "c3.1.19_gdn",
                        "name": "guidance",
                        "prose": "Organizations can use full-device encryption or container-based encryption to protect the confidentiality of CUI on mobile devices and computing platforms. Container-based encryption provides a more fine-grained approach to the encryption of data and information including, for example, encrypting selected data structures such as files, records, or fields.\\n\\nSee NIST Cryptographic Standards.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.1.19"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.1.20",
                "class": "SP800-171",
                "title": "Verify and control/limit connections to and use of external systems.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.1.20"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.1.20"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.1.20_smt",
                        "name": "statement",
                        "prose": "Verify and control/limit connections to and use of external systems.",
                        "parts": []
                    },
                    {
                        "id": "c3.1.20_gdn",
                        "name": "guidance",
                        "prose": "External systems are systems or components of systems for which organizations typically have no direct supervision and authority over the application of security requirements and controls or the determination of the effectiveness of implemented safeguards on those systems. External systems include, for example, personally owned systems or devices and privately-owned computing and communications devices resident in commercial or public facilities. This requirement also addresses the use of external systems for the processing, storage, or transmission of CUI, including accessing\\n\\ncloud services (e.g., infrastructure as a service, platform as a service, or software as a service) from organizational systems.\\n\\nOrganizations establish terms and conditions for the use of external systems in accordance with organizational security policies and procedures. Terms and conditions address as a minimum, the types of applications that can be accessed on organizational systems from external systems. If terms and conditions with the owners of external systems cannot be established, organizations may impose restrictions on organizational personnel using those external systems.\\n\\nThis requirement recognizes that there are circumstances where individuals using external systems (e.g., contractors, coalition partners) need to access organizational systems. In those situations, organizations need confidence that the external systems contain the necessary safeguards so as not to compromise, damage, or otherwise harm organizational systems. Verification that the required safeguards have been implemented can be achieved, for example, by third-party, independent assessments, attestations, or other means, depending on the assurance or confidence level required by organizations.\\n\\nNote that while “external” typically refers to outside of the organization’s direct supervision and authority, that is not always the case. Regarding the protection of CUI across an organization, the organization may have systems that process CUI and others that do not. And among the systems that process CUI there are likely access restrictions for CUI that apply between systems. Therefore, from the perspective of a given system, other systems within the organization may be considered “external\" to that system.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.1.20"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.1.21",
                "class": "SP800-171",
                "title": "Limit use of portable storage devices on external systems.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.1.21"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.1.21"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.1.21_smt",
                        "name": "statement",
                        "prose": "Limit use of portable storage devices on external systems.",
                        "parts": []
                    },
                    {
                        "id": "c3.1.21_gdn",
                        "name": "guidance",
                        "prose": "Limits on the use of organization-controlled portable storage devices in external systems include, for example, complete prohibition of the use of such devices or restrictions on how the devices may be used and under what conditions the devices may be used. Note that while “external” typically refers to outside of the organization’s direct supervision and authority, that is not always the case. Regarding the protection of CUI across an organization, the organization may have systems that process CUI and others that do not. And among the systems that process CUI there are likely access restrictions for CUI that apply between systems. Therefore, from the perspective of a given system, other systems within the organization may be considered “external\" to that system.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.1.21"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.1.22",
                "class": "SP800-171",
                "title": "Control CUI posted or processed on publicly accessible systems.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.1.22"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.1.22"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.1.22_smt",
                        "name": "statement",
                        "prose": "Control CUI posted or processed on publicly accessible systems.",
                        "parts": []
                    },
                    {
                        "id": "c3.1.22_gdn",
                        "name": "guidance",
                        "prose": "In accordance with laws, Executive Orders, directives, policies, regulations, or standards, the public is not authorized access to nonpublic information (e.g., information protected under the Privacy Act, CUI, and proprietary information). This requirement addresses systems that are controlled by the organization and accessible to the public, typically without identification or authentication. Individuals authorized to post CUI onto publicly accessible systems are designated. The content of information is reviewed prior to posting onto publicly accessible systems to ensure that nonpublic information is not included.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.1.22"
                            }
                        ]
                    }
                ]
            }
          ] 
        },
        {
          "id": "c3.2",
          "class": "family",
          "title": "Awareness and Training",
          "controls": [
            {
                "id": "c3.2.1",
                "class": "SP800-171",
                "title": "Ensure that managers, systems administrators, and users of organizational systems are made aware of the security risks associated with their activities and of the applicable policies, standards, and procedures related to the security of those systems.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.2.1"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.2.1"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.2.1_smt",
                        "name": "statement",
                        "prose": "Ensure that managers, systems administrators, and users of organizational systems are made aware of the security risks associated with their activities and of the applicable policies, standards, and procedures related to the security of those systems.",
                        "parts": []
                    },
                    {
                        "id": "c3.2.1_gdn",
                        "name": "guidance",
                        "prose": "Organizations determine the content and frequency of security awareness training and security awareness techniques based on the specific organizational requirements and the systems to which personnel have authorized access. The content includes a basic understanding of the need for information security and user actions to maintain security and to respond to suspected security incidents. The content also addresses awareness of the need for operations security. Security awareness techniques can include, for example, formal training, offering supplies inscribed with security reminders, generating email advisories or notices from organizational officials, displaying logon screen messages, displaying posters, and conducting information security awareness events.\\n\\nNIST Special Publication 800-50 provides guidance on security awareness and training programs.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.2.1"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.2.2",
                "class": "SP800-171",
                "title": "Ensure that personnel are trained to carry out their assigned information security-related duties and responsibilities.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.2.2"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.2.2"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.2.2_smt",
                        "name": "statement",
                        "prose": "Ensure that personnel are trained to carry out their assigned information security-related duties and responsibilities.",
                        "parts": []
                    },
                    {
                        "id": "c3.2.2_gdn",
                        "name": "guidance",
                        "prose": "Organizations determine the content and frequency of security training based on the assigned duties, roles, and responsibilities of individuals and the security requirements of organizations and the systems to which personnel have authorized access. In addition, organizations provide system developers, enterprise architects, security architects, acquisition/procurement officials, software developers, system developers, system or network administrators, personnel conducting configuration management and auditing activities, personnel performing independent verification and validation activities, security assessors, and other personnel having access to system-level software, adequate security-related technical training specifically tailored for their assigned duties.\\n\\nComprehensive role-based training addresses management, operational, and technical roles and responsibilities covering physical, personnel, and technical safeguards. Such training can include, for example, policies, procedures, tools, and artifacts for the organizational security roles defined. Organizations also provide the training necessary for individuals to carry out their responsibilities related to operations and supply chain security within the context of organizational information security programs.\\n\\nNIST Special Publication 800-181 provides guidance on role-based information security training in the workplace.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.2.2"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.2.3",
                "class": "SP800-171",
                "title": "Provide security awareness training on recognizing and reporting potential indicators of insider threat.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.2.3"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.2.3"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.2.3_smt",
                        "name": "statement",
                        "prose": "Provide security awareness training on recognizing and reporting potential indicators of insider threat.",
                        "parts": []
                    },
                    {
                        "id": "c3.2.3_gdn",
                        "name": "guidance",
                        "prose": "Potential indicators and possible precursors of insider threat include behaviors such as: inordinate, long-term job dissatisfaction; attempts to gain access to information that is not required for job performance; unexplained access to financial resources; bullying or sexual harassment of fellow employees; workplace violence; and other serious violations of organizational policies, procedures, directives, rules, or practices. Security awareness training includes how to communicate employee and management concerns regarding potential indicators of insider threat through appropriate organizational channels in accordance with established organizational policies and procedures. Organizations may consider tailoring insider threat awareness topics to the role (e.g., training for managers may be focused on specific changes in behavior of team members, while training for employees may be focused on more general observations). ",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.2.3"
                            }
                        ]
                    }
                ]
            }
          ] 
        },
        {
          "id": "c3.3",
          "class": "family",
          "title": "Audit and Accountability",
          "controls": [
            {
                "id": "c3.3.1",
                "class": "SP800-171",
                "title": "Create and retain system audit logs and records to the extent needed to enable the monitoring, analysis, investigation, and reporting of unlawful or unauthorized system activity.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.3.1"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.3.1"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.3.1_smt",
                        "name": "statement",
                        "prose": "Create and retain system audit logs and records to the extent needed to enable the monitoring, analysis, investigation, and reporting of unlawful or unauthorized system activity.",
                        "parts": []
                    },
                    {
                        "id": "c3.3.1_gdn",
                        "name": "guidance",
                        "prose": "An event is any observable occurrence in a system, which includes unlawful or unauthorized system activity. Organizations identify event types for which a logging functionality is needed as those events which are significant and relevant to the security of systems and the environments in which those systems operate to meet specific and ongoing auditing needs. Event types can include, for example, password changes, failed logons or failed accesses related to systems, administrative privilege usage, or third-party credential usage. In determining event types that require logging, organizations consider the monitoring and auditing appropriate for each of the CUI security requirements. Monitoring and auditing requirements can be balanced with other system needs. For example, organizations may determine that systems must have the capability to log every file access both successful and unsuccessful, but not activate that capability except for specific circumstances due to the potential burden on system performance.\\n\\nAudit records can be generated at various levels of abstraction, including at the packet level as information traverses the network. Selecting the appropriate level of abstraction is a critical aspect of an audit logging capability and can facilitate the identification of root causes to problems. Organizations consider in the definition of event types, the logging necessary to cover related events such as the steps in distributed, transaction-based processes (e.g., processes that are distributed across multiple organizations) and actions that occur in service-oriented or cloud-based architectures.\\n\\nAudit record content that may be necessary to satisfy this requirement includes, for example, time stamps, source and destination addresses, user/process identifiers, event descriptions, success/fail indications, filenames involved, and access control or flow control rules invoked. Event outcomes can include indicators of event success or failure and event-specific results (e.g., the security state of the system after the event occurred).\\n\\nDetailed information that organizations may consider in audit records includes, for example, full text recording of privileged commands or the individual identities of group account users. Organizations consider limiting the additional audit log information to only that information explicitly needed for specific audit requirements. This facilitates the use of audit trails and audit logs by not including information that could potentially be misleading or could make it more difficult to locate information of interest. Audit logs are reviewed and analyzed as often as needed to provide important information to organizations to facilitate risk-based decision making.\\n\\nNIST Special Publication 800-92 provides guidance on security log management.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.3.1"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.3.2",
                "class": "SP800-171",
                "title": "Ensure that the actions of individual system users can be uniquely traced to those users so they can be held accountable for their actions.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.3.2"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.3.2"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.3.2_smt",
                        "name": "statement",
                        "prose": "Ensure that the actions of individual system users can be uniquely traced to those users so they can be held accountable for their actions.",
                        "parts": []
                    },
                    {
                        "id": "c3.3.2_gdn",
                        "name": "guidance",
                        "prose": "This requirement ensures that the contents of the audit record include the information needed to link the audit event to the actions of an individual to the extent feasible. Organizations consider logging for traceability including, for example, results from monitoring of account usage, remote access, wireless connectivity, mobile device connection, configuration settings, use of maintenance tools, nonlocal maintenance, physical access, temperature and humidity, equipment delivery and removal, system component inventory, communications at the system boundaries, use of mobile code, and use of VoIP.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.3.2"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.3.3",
                "class": "SP800-171",
                "title": "Review and update logged events.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.3.3"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.3.3"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.3.3_smt",
                        "name": "statement",
                        "prose": "Review and update logged events.",
                        "parts": []
                    },
                    {
                        "id": "c3.3.3_gdn",
                        "name": "guidance",
                        "prose": "The intent of this requirement is to periodically re-evaluate which of the logged events will continue to be included in the list of events to be logged. Over time, the event types that are logged by organizations may change. Reviewing and updating the set of logged event types periodically is necessary to ensure that the current set remains necessary and sufficient.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.3.3"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.3.4",
                "class": "SP800-171",
                "title": "Alert in the event of an audit logging process failure.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.3.4"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.3.4"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.3.4_smt",
                        "name": "statement",
                        "prose": "Alert in the event of an audit logging process failure.",
                        "parts": []
                    },
                    {
                        "id": "c3.3.4_gdn",
                        "name": "guidance",
                        "prose": "Audit logging process failures include, for example, software/hardware errors, failures in the audit record capturing mechanisms, and audit record storage capacity being reached or exceeded. This requirement applies to each audit record data storage repository (i.e., distinct system component where audit records are stored), the total audit record storage capacity of organizations (i.e., all audit record data storage repositories combined), or both.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.3.4"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.3.5",
                "class": "SP800-171",
                "title": "Correlate audit record review, analysis, and reporting processes for investigation and response to indications of unlawful, unauthorized, suspicious, or unusual activity.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.3.5"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.3.5"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.3.5_smt",
                        "name": "statement",
                        "prose": "Correlate audit record review, analysis, and reporting processes for investigation and response to indications of unlawful, unauthorized, suspicious, or unusual activity.",
                        "parts": []
                    },
                    {
                        "id": "c3.3.5_gdn",
                        "name": "guidance",
                        "prose": "Correlating these processes helps to ensure that they do not operate independently, but rather collectively. Regarding the assessment of a given organizational system, the requirement is agnostic as to whether this correlation is applied at the system level or at the organization level across all systems.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.3.5"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.3.6",
                "class": "SP800-171",
                "title": "Provide audit record reduction and report generation to support on-demand analysis and reporting.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.3.6"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.3.6"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.3.6_smt",
                        "name": "statement",
                        "prose": "Provide audit record reduction and report generation to support on-demand analysis and reporting.",
                        "parts": []
                    },
                    {
                        "id": "c3.3.6_gdn",
                        "name": "guidance",
                        "prose": "Audit record reduction is a process that manipulates collected audit information and organizes such information in a summary format that is more meaningful to analysts. Audit record reduction and report generation capabilities do not always emanate from the same system or organizational entities conducting auditing activities. Audit record reduction capability can include, for example, modern data mining techniques with advanced data filters to identify anomalous behavior in audit records. The report generation capability provided by the system can help generate customizable reports. Time ordering of audit records can be a significant issue if the granularity of the time stamp in the record is insufficient.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.3.6"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.3.7",
                "class": "SP800-171",
                "title": "Provide a system capability that compares and synchronizes internal system clocks with an authoritative source to generate time stamps for audit records.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.3.7"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.3.7"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.3.7_smt",
                        "name": "statement",
                        "prose": "Provide a system capability that compares and synchronizes internal system clocks with an authoritative source to generate time stamps for audit records.",
                        "parts": []
                    },
                    {
                        "id": "c3.3.7_gdn",
                        "name": "guidance",
                        "prose": "Internal system clocks are used to generate time stamps, which include date and time. Time is expressed in Coordinated Universal Time (UTC), a modern continuation of Greenwich Mean Time (GMT), or local time with an offset from UTC. The granularity of time measurements refers to the degree of synchronization between system clocks and reference clocks, for example, clocks synchronizing within hundreds of milliseconds or within tens of milliseconds. Organizations may define different time granularities for different system components. Time service can also be critical to other security capabilities such as access control and identification and authentication, depending on the nature of the mechanisms used to support those capabilities. This requirement provides uniformity of time stamps for systems with multiple system clocks and systems connected over a network.\\n\\nSee IETF Network Time Protocol.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.3.7"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.3.8",
                "class": "SP800-171",
                "title": "Protect audit information and audit logging tools from unauthorized access, modification, and deletion.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.3.8"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.3.8"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.3.8_smt",
                        "name": "statement",
                        "prose": "Protect audit information and audit logging tools from unauthorized access, modification, and deletion.",
                        "parts": []
                    },
                    {
                        "id": "c3.3.8_gdn",
                        "name": "guidance",
                        "prose": "Audit information includes all information (e.g., audit records, audit log settings, and audit reports) needed to successfully audit system activity. Audit logging tools are those programs and devices used to conduct audit and logging activities. This requirement focuses on the technical protection of audit information and limits the ability to access and execute audit logging tools to authorized individuals. Physical protection of audit information is addressed by media protection and physical and environmental protection requirements.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.3.8"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.3.9",
                "class": "SP800-171",
                "title": "Limit management of audit logging functionality to a subset of privileged users.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.3.9"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.3.9"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.3.9_smt",
                        "name": "statement",
                        "prose": "Limit management of audit logging functionality to a subset of privileged users.",
                        "parts": []
                    },
                    {
                        "id": "c3.3.9_gdn",
                        "name": "guidance",
                        "prose": "Individuals with privileged access to a system and who are also the subject of an audit by that system, may affect the reliability of audit information by inhibiting audit logging activities or modifying audit records. This requirement specifies that privileged access be further defined between audit-related privileges and other privileges, thus limiting the users with audit-related privileges.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.3.9"
                            }
                        ]
                    }
                ]
            }
          ] 
        },
        {
          "id": "c3.4",
          "class": "family",
          "title": "Configuration Management",
          "controls": [
            {
                "id": "c3.4.1",
                "class": "SP800-171",
                "title": "Establish and maintain baseline configurations and inventories of organizational systems (including hardware, software, firmware, and documentation) throughout the respective system development life cycles.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.4.1"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.4.1"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.4.1_smt",
                        "name": "statement",
                        "prose": "Establish and maintain baseline configurations and inventories of organizational systems (including hardware, software, firmware, and documentation) throughout the respective system development life cycles.",
                        "parts": []
                    },
                    {
                        "id": "c3.4.1_gdn",
                        "name": "guidance",
                        "prose": "This requirement establishes baseline configurations for systems and system components including communications and connectivity aspects of systems. Baseline configurations are documented, formally reviewed, and agreed-upon sets of specifications for systems or configuration items within those systems. Baseline configurations serve as a basis for future builds, releases, and changes to systems. Baseline configurations include information about system components (e.g., standard software packages installed on workstations, notebook computers, servers, network components, or mobile devices; current version numbers and update and patch information on operating systems and applications; and configuration settings and parameters), network topology, and the logical placement of those components within the system architecture. Baseline configurations of systems reflect the current enterprise architecture. Maintaining effective baseline configurations requires creating new baselines as organizational systems change over time. Baseline configuration maintenance includes reviewing and updating the baseline configuration when changes are made based on security risks and deviations from the established baseline configuration\\n\\nOrganizations can implement centralized system component inventories that include components from multiple organizational systems. In such situations, organizations ensure that the resulting inventories include system-specific information required for proper component accountability (e.g., system association, system owner). Information deemed necessary for effective accountability of system components includes, for example, hardware inventory specifications, software license information, software version numbers, component owners, and for networked components or devices, machine names and network addresses. Inventory specifications include, for example, manufacturer, device type, model, serial number, and physical location.\\n\\nNIST Special Publication 800-128 provides guidance on security-focused configuration management",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.4.1"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.4.2",
                "class": "SP800-171",
                "title": "Establish and enforce security configuration settings for information technology products employed in organizational systems.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.4.2"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.4.2"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.4.2_smt",
                        "name": "statement",
                        "prose": "Establish and enforce security configuration settings for information technology products employed in organizational systems.",
                        "parts": []
                    },
                    {
                        "id": "c3.4.2_gdn",
                        "name": "guidance",
                        "prose": "Configuration settings are the set of parameters that can be changed in hardware, software, or firmware components of the system that affect the security posture or functionality of the system. Information technology products for which security-related configuration settings can be defined include, for example, mainframe computers, servers, workstations, input/output devices (e.g., scanners, copiers, and printers), network components (e.g., firewalls, routers, gateways, voice and data switches, devices, wireless access points, network appliances, sensors), operating systems, middleware, and applications.\\n\\nSecurity parameters are those parameters impacting the security state of systems including the parameters required to satisfy other security requirements. Security parameters include, for example: registry settings; account, file, directory permission settings; and settings for functions, ports, protocols, and remote connections. Organizations establish organization-wide configuration settings and subsequently derive specific configuration settings for systems. The established settings become part of the systems configuration baseline.\\n\\nCommon secure configurations (also referred to as security configuration checklists, lockdown and hardening guides, security reference guides, security technical implementation guides) provide recognized, standardized, and established benchmarks that stipulate secure configuration settings for specific information technology platforms/products and instructions for configuring those system components to meet operational requirements. Common secure configurations can be developed by a variety of organizations including, for example, information technology product developers, manufacturers, vendors, consortia, academia, industry, federal agencies, and other organizations in the public and private sectors.\\n\\nNIST Special Publications 800-70 and 800-128 provide guidance on security configuration settings.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.4.2"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.4.3",
                "class": "SP800-171",
                "title": "Track, review, approve or disapprove, and log changes to organizational systems.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.4.3"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.4.3"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.4.3_smt",
                        "name": "statement",
                        "prose": "Track, review, approve or disapprove, and log changes to organizational systems.",
                        "parts": []
                    },
                    {
                        "id": "c3.4.3_gdn",
                        "name": "guidance",
                        "prose": "Tracking, reviewing, approving/disapproving, and logging changes is called configuration change control. Configuration change control for organizational systems involves the systematic proposal, justification, implementation, testing, review, and disposition of changes to the systems, including system upgrades and modifications. Configuration change control includes changes to baseline configurations for components and configuration items of systems, changes to configuration settings for information technology products (e.g., operating systems, applications, firewalls, routers, and mobile devices), unscheduled and unauthorized changes, and changes to remediate vulnerabilities.\\n\\nProcesses for managing configuration changes to systems include, for example, Configuration Control Boards or Change Advisory Boards that review and approve proposed changes to systems. For new development systems or systems undergoing major upgrades, organizations consider including representatives from development organizations on the Configuration Control Boards or Change Advisory Boards. Audit logs of changes include activities before and after changes are made to organizational systems and the activities required to implement such changes.\\n\\nNIST Special Publication 800-128 provides guidance on configuration change control.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.4.3"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.4.4",
                "class": "SP800-171",
                "title": "Analyze the security impact of changes prior to implementation.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.4.4"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.4.4"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.4.4_smt",
                        "name": "statement",
                        "prose": "Analyze the security impact of changes prior to implementation.",
                        "parts": []
                    },
                    {
                        "id": "c3.4.4_gdn",
                        "name": "guidance",
                        "prose": "Organizational personnel with information security responsibilities (e.g., system administrators, system security officers, system security managers, and systems security engineers) conduct security impact analyses. Individuals conducting security impact analyses possess the necessary skills and technical expertise to analyze the changes to systems and the associated security ramifications. Security impact analysis may include, for example, reviewing security plans to understand security requirements and reviewing system design documentation to understand the implementation of safeguards and how specific changes might affect the safeguards. Security impact analyses may also include risk assessments to better understand the impact of the changes and to determine if additional safeguards are required.\\n\\nNIST Special Publication 800-128 provides guidance on configuration change control and security impact analysis.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.4.4"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.4.5",
                "class": "SP800-171",
                "title": "Define, document, approve, and enforce physical and logical access restrictions associated with changes to organizational systems.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.4.5"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.4.5"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.4.5_smt",
                        "name": "statement",
                        "prose": "Define, document, approve, and enforce physical and logical access restrictions associated with changes to organizational systems.",
                        "parts": []
                    },
                    {
                        "id": "c3.4.5_gdn",
                        "name": "guidance",
                        "prose": "Any changes to the hardware, software, or firmware components of systems can potentially have significant effects on the overall security of the systems. Therefore, organizations permit only qualified and authorized individuals to access systems for purposes of initiating changes, including upgrades and modifications. Access restrictions for change also include software libraries.\\n\\nAccess restrictions include, for example, physical and logical access control requirements, workflow automation, media libraries, abstract layers (e.g., changes implemented into external interfaces rather than directly into systems), and change windows (e.g., changes occur only during specified times). In addition to security concerns, commonly-accepted due diligence for configuration management includes access restrictions as an essential part in ensuring the ability to effectively manage the configuration.\\n\\nNIST Special Publication 800-128 provides guidance on configuration change control.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.4.5"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.4.6",
                "class": "SP800-171",
                "title": "Employ the principle of least functionality by configuring organizational systems to provide only essential capabilities.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.4.6"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.4.6"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.4.6_smt",
                        "name": "statement",
                        "prose": "Employ the principle of least functionality by configuring organizational systems to provide only essential capabilities.",
                        "parts": []
                    },
                    {
                        "id": "c3.4.6_gdn",
                        "name": "guidance",
                        "prose": "Systems can provide a wide variety of functions and services. Some of the functions and services routinely provided by default, may not be necessary to support essential organizational missions, functions, or operations. It is sometimes convenient to provide multiple services from single system components, but doing so increases risk over limiting the services provided by any one component. Where feasible, organizations limit component functionality to a single function per component.\\n\\nOrganizations review functions and services provided by systems or components of systems, to determine which functions and services are candidates for elimination. Organizations disable unused or unnecessary physical and logical ports and protocols to prevent unauthorized connection of devices, transfer of information, and tunneling. Organizations can utilize network scanning tools, intrusion detection and prevention systems, and end-point protections such as firewalls and host- based intrusion detection systems to identify and prevent the use of prohibited functions, ports, protocols, and services.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.4.6"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.4.7",
                "class": "SP800-171",
                "title": "Restrict, disable, or prevent the use of nonessential programs, functions, ports, protocols, and services.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.4.7"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.4.7"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.4.7_smt",
                        "name": "statement",
                        "prose": "Restrict, disable, or prevent the use of nonessential programs, functions, ports, protocols, and services.",
                        "parts": []
                    },
                    {
                        "id": "c3.4.7_gdn",
                        "name": "guidance",
                        "prose": "Restricting the use of nonessential software (programs) includes, for example, restricting the roles allowed to approve program execution; prohibiting auto-execute; program blacklisting and whitelisting; or restricting the number of program instances executed at the same time. The organization makes a security-based determination which functions, ports, protocols, and/or services are restricted. Bluetooth, FTP, and peer-to-peer networking are examples of protocols organizations consider preventing the use of, restricting, or disabling.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.4.7"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.4.8",
                "class": "SP800-171",
                "title": "Apply deny-by-exception (blacklisting) policy to prevent the use of unauthorized software or deny-all, permit-by-exception (whitelisting) policy to allow the execution of authorized software.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.4.8"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.4.8"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.4.8_smt",
                        "name": "statement",
                        "prose": "Apply deny-by-exception (blacklisting) policy to prevent the use of unauthorized software or deny-all, permit-by-exception (whitelisting) policy to allow the execution of authorized software.",
                        "parts": []
                    },
                    {
                        "id": "c3.4.8_gdn",
                        "name": "guidance",
                        "prose": "The process used to identify software programs that are not authorized to execute on systems is commonly referred to as blacklisting. The process used to identify software programs that are authorized to execute on systems is commonly referred to as whitelisting. Whitelisting is the stronger of the two policies for restricting software program execution. In addition to whitelisting, organizations consider verifying the integrity of whitelisted software programs using, for example, cryptographic checksums, digital signatures, or hash functions. Verification of whitelisted software can occur either prior to execution or at system startup.\\n\\nNIST Special Publication 800-167 provides guidance on application whitelisting.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.4.8"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.4.9",
                "class": "SP800-171",
                "title": "Control and monitor user-installed software.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.4.9"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.4.9"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.4.9_smt",
                        "name": "statement",
                        "prose": "Control and monitor user-installed software.",
                        "parts": []
                    },
                    {
                        "id": "c3.4.9_gdn",
                        "name": "guidance",
                        "prose": " Users can install software in organizational systems if provided the necessary privileges. To maintain control over the software installed, organizations identify permitted and prohibited actions regarding software installation through policies. Permitted software installations include, for example, updates and security patches to existing software and downloading applications from organization-approved “app stores.” Prohibited software installations may include, for example, software with unknown or suspect pedigrees or software that organizations consider potentially malicious. The policies organizations select governing user-installed software may be organization- developed or provided by some external entity. Policy enforcement methods include procedural methods, automated methods, or both.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.4.9"
                            }
                        ]
                    }
                ]
            }
          ] 
        },
        {
          "id": "c3.5",
          "class": "family",
          "title": "Identification and Authentication",
          "controls": [
            {
                "id": "c3.5.1",
                "class": "SP800-171",
                "title": "Identify system users, processes acting on behalf of users, and devices.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.5.1"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.5.1"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.5.1_smt",
                        "name": "statement",
                        "prose": "Identify system users, processes acting on behalf of users, and devices.",
                        "parts": []
                    },
                    {
                        "id": "c3.5.1_gdn",
                        "name": "guidance",
                        "prose": "Common device identifiers include, for example, media access control (MAC), Internet protocol (IP) addresses, or device-unique token identifiers. Management of individual identifiers is not applicable to shared system accounts. Typically, individual identifiers are the user names associated with the system accounts assigned to those individuals. Organizations may require unique identification of individuals in group accounts or for detailed accountability of individual activity. In addition, this requirement addresses individual identifiers that are not necessarily associated with system accounts. Organizational devices requiring identification may be defined by type, by device, or by a combination of type/device.\\n\\nNIST Special Publication 800-63 provides guidance on digital identities.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.5.1"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.5.2",
                "class": "SP800-171",
                "title": "Authenticate (or verify) the identities of users, processes, or devices, as a prerequisite to allowing access to organizational systems.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.5.2"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.5.2"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.5.2_smt",
                        "name": "statement",
                        "prose": "Authenticate (or verify) the identities of users, processes, or devices, as a prerequisite to allowing access to organizational systems.",
                        "parts": []
                    },
                    {
                        "id": "c3.5.2_gdn",
                        "name": "guidance",
                        "prose": "Individual authenticators include, for example, passwords, key cards, cryptographic devices, and one-time password devices. Initial authenticator content is the actual content of the authenticator, for example, the initial password. In contrast, the requirements about authenticator content include, for example, the minimum password length. Developers ship system components with factory default authentication credentials to allow for initial installation and configuration. Default authentication credentials are often well known, easily discoverable, and present a significant security risk.\\n\\nSystems support authenticator management by organization-defined settings and restrictions for various authenticator characteristics including, for example, minimum password length, validation time window for time synchronous one-time tokens, and number of allowed rejections during the verification stage of biometric authentication. Authenticator management includes issuing and revoking, when no longer needed, authenticators for temporary access such as that required for remote maintenance. Device authenticators include, for example, certificates and passwords.\\n\\nNIST Special Publication 800-63 provides guidance on digital identities.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.5.2"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.5.3",
                "class": "SP800-171",
                "title": "Use multifactor authentication for local and network access to privileged accounts and for network access to non-privileged accounts.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.5.3"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.5.3"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.5.3_smt",
                        "name": "statement",
                        "prose": "Use multifactor authentication for local and network access to privileged accounts and for network access to non-privileged accounts.",
                        "parts": []
                    },
                    {
                        "id": "c3.5.3_gdn",
                        "name": "guidance",
                        "prose": "Multifactor authentication requires the use of two or more different factors to authenticate. The factors are defined as something you know (e.g., password, personal identification number [PIN]); something you have (e.g., cryptographic identification device, token); or something you are (e.g., biometric). Multifactor solutions that feature physical authenticators include, for example, hardware authenticators providing time-based or challenge-response authenticators and smart cards. In addition to authenticating users at the system level (i.e., at logon), organizations may also employ authentication mechanisms at the application level, when necessary, to provide increased information security.\\n\\nAccess to organizational systems is defined as local access or network access. Local access is any access to organizational systems by users (or processes acting on behalf of users) where such access is obtained by direct connections without the use of networks. Network access is access to systems by users (or processes acting on behalf of users) where such access is obtained through network connections (i.e., nonlocal accesses). Remote access is a type of network access that involves communication through external networks. The use of encrypted virtual private networks for network connections between organization-controlled endpoints and non-organization controlled endpoints may be treated as internal networks with regard to protecting the confidentiality of information traversing the network.\\n\\nNIST Special Publication 800-63 provides guidance on digital identities.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.5.3"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.5.4",
                "class": "SP800-171",
                "title": "Employ replay-resistant authentication mechanisms for network access to privileged and non- privileged accounts.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.5.4"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.5.4"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.5.4_smt",
                        "name": "statement",
                        "prose": "Employ replay-resistant authentication mechanisms for network access to privileged and non- privileged accounts.",
                        "parts": []
                    },
                    {
                        "id": "c3.5.4_gdn",
                        "name": "guidance",
                        "prose": "Authentication processes resist replay attacks if it is impractical to successfully authenticate by recording or replaying previous authentication messages. Replay-resistant techniques include, for example, protocols that use nonces or challenges such as time synchronous or challenge-response one-time authenticators.\\n\\nNIST Special Publication 800-63 provides guidance on digital identities.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.5.4"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.5.5",
                "class": "SP800-171",
                "title": "Prevent reuse of identifiers for a defined period.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.5.5"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.5.5"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.5.5_smt",
                        "name": "statement",
                        "prose": "Prevent reuse of identifiers for a defined period.",
                        "parts": []
                    },
                    {
                        "id": "c3.5.5_gdn",
                        "name": "guidance",
                        "prose": "Identifiers are provided for users, processes acting on behalf of users, or devices (3.5.1). Preventing reuse of identifiers implies preventing the assignment of previously used individual, group, role, or device identifiers to different individuals, groups, roles, or devices.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.5.5"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.5.6",
                "class": "SP800-171",
                "title": "Disable identifiers after a defined period of inactivity.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.5.6"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.5.6"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.5.6_smt",
                        "name": "statement",
                        "prose": "Disable identifiers after a defined period of inactivity.",
                        "parts": []
                    },
                    {
                        "id": "c3.5.6_gdn",
                        "name": "guidance",
                        "prose": "Inactive identifiers pose a risk to organizational information because attackers may exploit an inactive identifier to gain undetected access to organizational devices. The owners of the inactive accounts may not notice if unauthorized access to the account has been obtained.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.5.6"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.5.7",
                "class": "SP800-171",
                "title": "Enforce a minimum password complexity and change of characters when new passwords are created.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.5.7"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.5.7"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.5.7_smt",
                        "name": "statement",
                        "prose": "Enforce a minimum password complexity and change of characters when new passwords are created.",
                        "parts": []
                    },
                    {
                        "id": "c3.5.7_gdn",
                        "name": "guidance",
                        "prose": "This requirement applies to single-factor authentication of individuals using passwords as individual or group authenticators, and in a similar manner, when passwords are used as part of multifactor authenticators. The number of changed characters refers to the number of changes required with respect to the total number of positions in the current password. To mitigate certain brute force attacks against passwords, organizations may also consider salting passwords.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.5.7"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.5.8",
                "class": "SP800-171",
                "title": "Prohibit password reuse for a specified number of generations.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.5.8"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.5.8"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.5.8_smt",
                        "name": "statement",
                        "prose": "Prohibit password reuse for a specified number of generations.",
                        "parts": []
                    },
                    {
                        "id": "c3.5.8_gdn",
                        "name": "guidance",
                        "prose": "Password lifetime restrictions do not apply to temporary passwords.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.5.8"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.5.9",
                "class": "SP800-171",
                "title": "Allow temporary password use for system logons with an immediate change to a permanent password.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.5.9"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.5.9"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.5.9_smt",
                        "name": "statement",
                        "prose": "Allow temporary password use for system logons with an immediate change to a permanent password.",
                        "parts": []
                    },
                    {
                        "id": "c3.5.9_gdn",
                        "name": "guidance",
                        "prose": "Changing temporary passwords to permanent passwords immediately after system logon ensures that the necessary strength of the authentication mechanism is implemented at the earliest opportunity, reducing the susceptibility to authenticator compromises.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.5.9"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.5.10",
                "class": "SP800-171",
                "title": "Store and transmit only cryptographically-protected passwords.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.5.10"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.5.10"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.5.10_smt",
                        "name": "statement",
                        "prose": "Store and transmit only cryptographically-protected passwords.",
                        "parts": []
                    },
                    {
                        "id": "c3.5.10_gdn",
                        "name": "guidance",
                        "prose": "Cryptographically-protected passwords include, for example, salted one-way cryptographic hashes of passwords.\\n\\nSee NIST Cryptographic Standards.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.5.10"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.5.11",
                "class": "SP800-171",
                "title": "Obscure feedback of authentication information.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.5.11"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.5.11"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.5.11_smt",
                        "name": "statement",
                        "prose": "Obscure feedback of authentication information.",
                        "parts": []
                    },
                    {
                        "id": "c3.5.11_gdn",
                        "name": "guidance",
                        "prose": "The feedback from systems does not provide information that would allow unauthorized individuals to compromise authentication mechanisms. For some types of systems or system components, for example, desktop or notebook computers with relatively large monitors, the threat (often referred to as shoulder surfing) may be significant. For other types of systems or components, for example, mobile devices with small displays, this threat may be less significant, and is balanced against the increased likelihood of typographic input errors due to the small keyboards. Therefore, the means for obscuring the authenticator feedback is selected accordingly. Obscuring authenticator feedback includes, for example, displaying asterisks when users type passwords into input devices, or displaying feedback for a very limited time before fully obscuring it.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.5.11"
                            }
                        ]
                    }
                ]
            }
          ] 
        },
        {
          "id": "c3.6",
          "class": "family",
          "title": "Incident Response",
          "controls": [
            {
                "id": "c3.6.1",
                "class": "SP800-171",
                "title": "Establish an operational incident-handling capability for organizational systems that includes preparation, detection, analysis, containment, recovery, and user response activities.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.6.1"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.6.1"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.6.1_smt",
                        "name": "statement",
                        "prose": "Establish an operational incident-handling capability for organizational systems that includes preparation, detection, analysis, containment, recovery, and user response activities.",
                        "parts": []
                    },
                    {
                        "id": "c3.6.1_gdn",
                        "name": "guidance",
                        "prose": "Organizations recognize that incident handling capability is dependent on the capabilities of organizational systems and the mission/business processes being supported by those systems. Organizations consider incident handling as part of the definition, design, and development of mission/business processes and systems. Incident-related information can be obtained from a variety of sources including, for example, audit monitoring, network monitoring, physical access monitoring, user and administrator reports, and reported supply chain events. Effective incident handling capability includes coordination among many organizational entities including, for example, mission/business owners, system owners, authorizing officials, human resources offices, physical and personnel security offices, legal departments, operations personnel, procurement offices, and the risk executive.\\n\\nAs part of user response activities, incident response training is provided by organizations and is linked directly to the assigned roles and responsibilities of organizational personnel to ensure that the appropriate content and level of detail is included in such training. For example, regular users may only need to know who to call or how to recognize an incident on the system; system administrators may require additional training on how to handle or remediate incidents; and incident responders may receive more specific training on forensics, reporting, system recovery, and restoration. Incident response training includes user training in the identification/reporting of suspicious activities from external and internal sources. User response activities also includes incident response assistance which may consist of help desk support, assistance groups, and access to forensics services or consumer redress services, when required. NIST Special Publication 800-61 provides guidance on incident handling.\\n\\nNIST Special Publications 800-86 and 800-101 provide guidance on integrating forensic techniques into incident response.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.6.1"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.6.2",
                "class": "SP800-171",
                "title": "Track, document, and report incidents to designated officials and/or authorities both internal and external to the organization.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.6.2"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.6.2"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.6.2_smt",
                        "name": "statement",
                        "prose": "Track, document, and report incidents to designated officials and/or authorities both internal and external to the organization.",
                        "parts": []
                    },
                    {
                        "id": "c3.6.2_gdn",
                        "name": "guidance",
                        "prose": "Tracking and documenting system security incidents includes, for example, maintaining records about each incident, the status of the incident, and other pertinent information necessary for forensics, evaluating incident details, trends, and handling. Incident information can be obtained from a variety of sources including, for example, incident reports, incident response teams, audit monitoring, network monitoring, physical access monitoring, and user/administrator reports.\\n\\nReporting incidents addresses specific incident reporting requirements within an organization and the formal incident reporting requirements for the organization. Suspected security incidents may also be reported and include, for example, the receipt of suspicious email communications that can potentially contain malicious code. The types of security incidents reported, the content and timeliness of the reports, and the designated reporting authorities reflect applicable laws, Executive Orders, directives, regulations, and policies.\\n\\nNIST Special Publication 800-61 provides guidance on incident handling.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.6.2"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.6.3",
                "class": "SP800-171",
                "title": "Test the organizational incident response capability.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.6.3"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.6.3"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.6.3_smt",
                        "name": "statement",
                        "prose": "Test the organizational incident response capability.",
                        "parts": []
                    },
                    {
                        "id": "c3.6.3_gdn",
                        "name": "guidance",
                        "prose": "Organizations test incident response capabilities to determine the overall effectiveness of the capabilities and to identify potential weaknesses or deficiencies. Incident response testing includes, for example, the use of checklists, walk-through or tabletop exercises, simulations (parallel and full interrupt), and comprehensive exercises. Incident response testing can also include a determination of the effects on organizational operations (e.g., reduction in mission capabilities), organizational assets, and individuals due to incident response.\\n\\nNIST Special Publication 800-84 provides guidance on testing programs for information technology capabilities.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.6.3"
                            }
                        ]
                    }
                ]
            }
          ] 
        },
        {
          "id": "c3.7",
          "class": "family",
          "title": "Maintenance",
          "controls": [
            {
                "id": "c3.7.1",
                "class": "SP800-171",
                "title": "Perform maintenance on organizational systems. ",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.7.1"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.7.1"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.7.1_smt",
                        "name": "statement",
                        "prose": "Perform maintenance on organizational systems. ",
                        "parts": []
                    },
                    {
                        "id": "c3.7.1_gdn",
                        "name": "guidance",
                        "prose": "This requirement addresses the information security aspects of the system maintenance program and applies to all types of maintenance to any system component (including hardware, firmware, applications) conducted by any local or nonlocal entity. System maintenance also includes those components not directly associated with information processing and data or information retention such as scanners, copiers, and printers.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.7.1"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.7.2",
                "class": "SP800-171",
                "title": "Provide controls on the tools, techniques, mechanisms, and personnel used to conduct system maintenance.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.7.2"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.7.2"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.7.2_smt",
                        "name": "statement",
                        "prose": "Provide controls on the tools, techniques, mechanisms, and personnel used to conduct system maintenance.",
                        "parts": []
                    },
                    {
                        "id": "c3.7.2_gdn",
                        "name": "guidance",
                        "prose": "This requirement addresses security-related issues with maintenance tools that are not within the organizational system boundaries that process, store, or transmit CUI, but are used specifically for diagnostic and repair actions on those systems. Organizations have flexibility in determining the controls in place for maintenance tools, but can include approving, controlling, and monitoring the use of such tools. Maintenance tools are potential vehicles for transporting malicious code, either intentionally or unintentionally, into a facility and into organizational systems. Maintenance tools can include hardware, software, and firmware items, for example, hardware and software diagnostic test equipment and hardware and software packet sniffers.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.7.2"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.7.3",
                "class": "SP800-171",
                "title": "Ensure equipment removed for off-site maintenance is sanitized of any CUI.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.7.3"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.7.3"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.7.3_smt",
                        "name": "statement",
                        "prose": "Ensure equipment removed for off-site maintenance is sanitized of any CUI.",
                        "parts": []
                    },
                    {
                        "id": "c3.7.3_gdn",
                        "name": "guidance",
                        "prose": "This control addresses the information security aspects of system maintenance that is performed off-site and applies to all types of maintenance to any system component (including applications) conducted by a local or nonlocal entity (e.g., in-contract, warranty, in- house, software maintenance agreement).\\n\\nNIST Special Publication 800-88 provides guidance on media sanitization.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.7.3"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.7.4",
                "class": "SP800-171",
                "title": "Check media containing diagnostic and test programs for malicious code before the media are used in organizational systems.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.7.4"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.7.4"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.7.4_smt",
                        "name": "statement",
                        "prose": "Check media containing diagnostic and test programs for malicious code before the media are used in organizational systems.",
                        "parts": []
                    },
                    {
                        "id": "c3.7.4_gdn",
                        "name": "guidance",
                        "prose": "If, upon inspection of media containing maintenance diagnostic and test programs, organizations determine that the media contain malicious code, the incident is handled consistent with incident handling policies and procedures.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.7.4"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.7.5",
                "class": "SP800-171",
                "title": "Require multifactor authentication to establish nonlocal maintenance sessions via external network connections and terminate such connections when nonlocal maintenance is complete.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.7.5"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.7.5"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.7.5_smt",
                        "name": "statement",
                        "prose": "Require multifactor authentication to establish nonlocal maintenance sessions via external network connections and terminate such connections when nonlocal maintenance is complete.",
                        "parts": []
                    },
                    {
                        "id": "c3.7.5_gdn",
                        "name": "guidance",
                        "prose": "Nonlocal maintenance and diagnostic activities are those activities conducted by individuals communicating through an external network. Authentication techniques used in the establishment of these nonlocal maintenance and diagnostic sessions reflect the network access requirements in 3.5.3.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.7.5"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.7.6",
                "class": "SP800-171",
                "title": "Supervise the maintenance activities of maintenance personnel without required access authorization.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.7.6"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.7.6"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.7.6_smt",
                        "name": "statement",
                        "prose": "Supervise the maintenance activities of maintenance personnel without required access authorization.",
                        "parts": []
                    },
                    {
                        "id": "c3.7.6_gdn",
                        "name": "guidance",
                        "prose": "This requirement applies to individuals performing hardware or software maintenance on organizational systems, while 3.10.1 addresses physical access for individuals whose maintenance duties place them within the physical protection perimeter of the systems (e.g., custodial staff, physical plant maintenance personnel). Individuals not previously identified as authorized maintenance personnel, such as information technology manufacturers, vendors, consultants, and systems integrators, may require privileged access to organizational systems, for example, when required to conduct maintenance activities with little or no notice. Organizations may choose to issue temporary credentials to these individuals based on organizational risk assessments. Temporary credentials may be for one-time use or for very limited time periods.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.7.6"
                            }
                        ]
                    }
                ]
            }
          ] 
        },
        {
          "id": "c3.8",
          "class": "family",
          "title": "Media Protection",
          "controls": [
            {
                "id": "c3.8.1",
                "class": "SP800-171",
                "title": "Protect (i.e., physically control and securely store) system media containing CUI, both paper and digital.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.8.1"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.8.1"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.8.1_smt",
                        "name": "statement",
                        "prose": "Protect (i.e., physically control and securely store) system media containing CUI, both paper and digital.",
                        "parts": []
                    },
                    {
                        "id": "c3.8.1_gdn",
                        "name": "guidance",
                        "prose": "System media includes digital and non-digital media. Digital media includes, for example, diskettes, magnetic tapes, external and removable hard disk drives, flash drives, compact disks, and digital video disks. Non-digital media includes, for example, paper and microfilm. Protecting digital media includes, for example, limiting access to design specifications stored on compact disks or flash drives in the media library to the project leader and any individuals on the development team. Physically controlling system media includes, for example, conducting inventories, maintaining accountability for stored media, and ensuring procedures are in place to allow individuals to check out and return media to the media library. Secure storage includes, for example, a locked drawer, desk, or cabinet, or a controlled media library.\\n\\nAccess to CUI on system media can be limited by physically controlling such media, which includes, for example, conducting inventories, ensuring procedures are in place to allow individuals to check out and return media to the media library, and maintaining accountability for all stored media.\\n\\nNIST Special Publication 800-111 provides guidance on storage encryption technologies for end user devices.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.8.1"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.8.2",
                "class": "SP800-171",
                "title": "Limit access to CUI on system media to authorized users.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.8.2"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.8.2"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.8.2_smt",
                        "name": "statement",
                        "prose": "Limit access to CUI on system media to authorized users.",
                        "parts": []
                    },
                    {
                        "id": "c3.8.2_gdn",
                        "name": "guidance",
                        "prose": "Access can be limited by physically controlling system media and secure storage. Physically controlling system media includes, for example, conducting inventories, ensuring procedures are in place to allow individuals to check out and return media to the media library, and maintaining accountability for all stored media. Secure storage includes, for example, a locked drawer, desk, or cabinet, or a controlled media library.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.8.2"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.8.3",
                "class": "SP800-171",
                "title": "Sanitize or destroy system media containing CUI before disposal or release for reuse.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.8.3"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.8.3"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.8.3_smt",
                        "name": "statement",
                        "prose": "Sanitize or destroy system media containing CUI before disposal or release for reuse.",
                        "parts": []
                    },
                    {
                        "id": "c3.8.3_gdn",
                        "name": "guidance",
                        "prose": "This requirement applies to all system media, digital and non-digital, subject to disposal or reuse, whether or not the media is considered removable. Examples include: digital media found in scanners, copiers, printers, notebook computers, workstations, network components, and mobile devices; and non-digital media such as paper and microfilm. The sanitization process removes information from the media such that the information cannot be retrieved or reconstructed. Sanitization techniques, including clearing, purging, cryptographic erase, and destruction, prevent the disclosure of information to unauthorized individuals when such media is released for reuse or disposal.\\n\\nOrganizations determine the appropriate sanitization methods, recognizing that destruction may be necessary when other methods cannot be applied to media requiring sanitization. Organizations use discretion on the employment of approved sanitization techniques and procedures for media containing information in the public domain or publicly releasable, or deemed to have no adverse impact on organizations or individuals if released for reuse or disposal. Sanitization of non-digital media includes, for example, destruction, removing CUI from a document, or redacting selected sections or words from a document by obscuring the redacted sections or words in a manner equivalent in effectiveness to removing the words or sections from the document. NARA policy and guidance control the sanitization process for controlled unclassified information.\\n\\nSee NARA Sanitization Policy and Guidance. NIST Special Publication 800-88 provides guidance on media sanitization.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.8.3"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.8.4",
                "class": "SP800-171",
                "title": "Mark media with necessary CUI markings and distribution limitations.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.8.4"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.8.4"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.8.4_smt",
                        "name": "statement",
                        "prose": "Mark media with necessary CUI markings and distribution limitations.",
                        "parts": []
                    },
                    {
                        "id": "c3.8.4_gdn",
                        "name": "guidance",
                        "prose": "The term security marking refers to the application or use of human-readable security attributes. System media includes digital and non-digital media. Marking of system media reflects applicable federal laws, Executive Orders, directives, policies, and regulations.\\n\\nSee NARA Marking Handbook.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.8.4"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.8.5",
                "class": "SP800-171",
                "title": "Control access to media containing CUI and maintain accountability for media during transport outside of controlled areas.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.8.5"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.8.5"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.8.5_smt",
                        "name": "statement",
                        "prose": "Control access to media containing CUI and maintain accountability for media during transport outside of controlled areas.",
                        "parts": []
                    },
                    {
                        "id": "c3.8.5_gdn",
                        "name": "guidance",
                        "prose": "Controlled areas are areas or spaces for which organizations provide physical or procedural safeguards to meet the requirements established for protecting systems and information. Safeguards to maintain accountability for media during transport include, for example, locked containers and cryptography. Cryptographic mechanisms can provide confidentiality and integrity protections depending upon the mechanisms used. Activities associated with transport include the actual transport as well as those activities such as releasing media for transport and ensuring that media enters the appropriate transport processes. For the actual transport, authorized transport and courier personnel may include individuals from outside the organization. Maintaining accountability of media during transport includes, for example, restricting transport activities to authorized personnel, and tracking and obtaining explicit records of transport activities as the media moves through the transportation system to prevent and detect loss, destruction, or tampering.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.8.5"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.8.6",
                "class": "SP800-171",
                "title": "Implement cryptographic mechanisms to protect the confidentiality of CUI stored on digital media during transport unless otherwise protected by alternative physical safeguards.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.8.6"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.8.6"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.8.6_smt",
                        "name": "statement",
                        "prose": "Implement cryptographic mechanisms to protect the confidentiality of CUI stored on digital media during transport unless otherwise protected by alternative physical safeguards.",
                        "parts": []
                    },
                    {
                        "id": "c3.8.6_gdn",
                        "name": "guidance",
                        "prose": "This requirement applies to portable storage devices (e.g., USB memory sticks, digital video disks, compact disks, external or removable hard disk drives). NIST Special Publication 800-111 provides guidance on storage encryption technologies for end user devices.\\n\\nSee NIST Cryptographic Standards.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.8.6"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.8.7",
                "class": "SP800-171",
                "title": "Control the use of removable media on system components.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.8.7"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.8.7"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.8.7_smt",
                        "name": "statement",
                        "prose": "Control the use of removable media on system components.",
                        "parts": []
                    },
                    {
                        "id": "c3.8.7_gdn",
                        "name": "guidance",
                        "prose": "In contrast to requirement 3.8.1, which restricts user access to media, this requirement restricts the use of certain types of media on systems, for example, restricting or prohibiting the use of flash drives or external hard disk drives. Organizations can employ technical and nontechnical safeguards (e.g., policies, procedures, rules of behavior) to control the use of system media. Organizations may control the use of portable storage devices, for example, by using physical cages on workstations to prohibit access to certain external ports, or disabling or removing the ability to insert, read, or write to such devices.\\n\\nOrganizations may also limit the use of portable storage devices to only approved devices including, for example, devices provided by the organization, devices provided by other approved organizations, and devices that are not personally owned. Finally, organizations may control the use of portable storage devices based on the type of device, for example, prohibiting the use of writeable, portable storage devices, and implementing this restriction by disabling or removing the capability to write to such devices.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.8.7"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.8.8",
                "class": "SP800-171",
                "title": "Prohibit the use of portable storage devices when such devices have no identifiable owner.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.8.8"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.8.8"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.8.8_smt",
                        "name": "statement",
                        "prose": "Prohibit the use of portable storage devices when such devices have no identifiable owner.",
                        "parts": []
                    },
                    {
                        "id": "c3.8.8_gdn",
                        "name": "guidance",
                        "prose": "Requiring identifiable owners (e.g., individuals, organizations, or projects) for portable storage devices reduces the risk of using such technologies by allowing organizations to assign responsibility and accountability for addressing known vulnerabilities in the devices (e.g., insertion of malicious code). ",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.8.8"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.8.9",
                "class": "SP800-171",
                "title": "Protect the confidentiality of backup CUI at storage locations.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.8.9"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.8.9"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.8.9_smt",
                        "name": "statement",
                        "prose": "Protect the confidentiality of backup CUI at storage locations.",
                        "parts": []
                    },
                    {
                        "id": "c3.8.9_gdn",
                        "name": "guidance",
                        "prose": "Organizations can employ cryptographic mechanisms or alternative physical safeguards to protect the confidentiality of backup information at designated storage locations. Backed-up information containing CUI may include system-level information and user-level information. System-level information includes, for example, system-state information, operating system software and application software, and licenses. User-level information includes information other than system- level information. ",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.8.9"
                            }
                        ]
                    }
                ]
            }
          ] 
        },
        {
          "id": "c3.9",
          "class": "family",
          "title": "Personnell Security",
          "controls": [
            {
                "id": "c3.9.1",
                "class": "SP800-171",
                "title": "Screen individuals prior to authorizing access to organizational systems containing CUI.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.9.1"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.9.1"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.9.1_smt",
                        "name": "statement",
                        "prose": "Screen individuals prior to authorizing access to organizational systems containing CUI.",
                        "parts": []
                    },
                    {
                        "id": "c3.9.1_gdn",
                        "name": "guidance",
                        "prose": "Personnel screening activities reflect applicable federal laws, Executive Orders, directives, policies, regulations, and specific criteria established for the level of access required for assigned positions.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.9.1"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.9.2",
                "class": "SP800-171",
                "title": "Ensure that organizational systems containing CUI are protected during and after personnel actions such as terminations and transfers.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.9.2"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.9.2"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.9.2_smt",
                        "name": "statement",
                        "prose": "Ensure that organizational systems containing CUI are protected during and after personnel actions such as terminations and transfers.",
                        "parts": []
                    },
                    {
                        "id": "c3.9.2_gdn",
                        "name": "guidance",
                        "prose": "Protecting CUI during and after personnel actions may include, for example, return of system- related property and exit interviews. System-related property includes, for example, hardware authentication tokens, identification cards, system administration technical manuals, keys, and building passes. Exit interviews ensure that individuals who have been terminated understand the security constraints imposed by being former employees and that proper accountability is achieved for system-related property. Security topics of interest at exit interviews can include, for example, reminding terminated individuals of nondisclosure agreements and potential limitations on future employment. Exit interviews may not be possible for some terminated individuals, for example, in cases related to job abandonment, illnesses, and non-availability of supervisors. For termination actions, timely execution is essential for individuals terminated for cause. In certain situations, organizations consider disabling the system accounts of individuals that are being terminated prior to the individuals being notified.\\n\\nThis requirement applies to reassignments or transfers of individuals when the personnel action is permanent or of such extended durations as to require protection. Organizations define the CUI protections appropriate for the types of reassignments or transfers, whether permanent or extended. Protections that may be required for transfers or reassignments to other positions within organizations include, for example, returning old and issuing new keys, identification cards, and building passes; closing system accounts and establishing new accounts; changing system access authorizations (i.e., privileges); and providing for access to official records to which individuals had access at previous work locations and in previous system accounts.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.9.2"
                            }
                        ]
                    }
                ]
            }
          ] 
        },
        {
          "id": "c3.10",
          "class": "family",
          "title": "Physical Security",
          "controls": [
            {
                "id": "c3.10.1",
                "class": "SP800-171",
                "title": "Limit physical access to organizational systems, equipment, and the respective operating environments to authorized individuals.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.10.1"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.10.1"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.10.1_smt",
                        "name": "statement",
                        "prose": "Limit physical access to organizational systems, equipment, and the respective operating environments to authorized individuals.",
                        "parts": []
                    },
                    {
                        "id": "c3.10.1_gdn",
                        "name": "guidance",
                        "prose": "This requirement applies to organizational employees, individuals with permanent physical access authorization credentials, and visitors. Authorized individuals have credentials which include, for example, badges, identification cards, and smart cards. Organizations determine the strength of authorization credentials needed consistent with applicable laws, directives, policies, regulations, standards, procedures, and guidelines. This requirement applies only to areas within facilities that have not been designated as publicly accessible.\\n\\nLimiting physical access to equipment may include, for example, placing equipment in locked rooms or other secured areas and allowing access to authorized individuals only, and placing equipment in locations that can be monitored by organizational personnel. Computing devices, external hard disk drives, networking devices, monitors, printers, copiers, scanners, facsimile machines, and audio devices are examples of equipment.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.10.1"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.10.2",
                "class": "SP800-171",
                "title": "Protect and monitor the physical facility and support infrastructure for organizational systems.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.10.2"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.10.2"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.10.2_smt",
                        "name": "statement",
                        "prose": "Protect and monitor the physical facility and support infrastructure for organizational systems.",
                        "parts": []
                    },
                    {
                        "id": "c3.10.2_gdn",
                        "name": "guidance",
                        "prose": "Monitoring of physical access includes publicly accessible areas within organizational facilities. This can be accomplished, for example, by the employment of guards; the use of sensor devices; or the use of video surveillance equipment such as cameras. Examples of support infrastructure include system distribution, transmission, and power lines. Security safeguards applied to the support infrastructure prevent accidental damage, disruption, and physical tampering. Such safeguards may also be necessary to help prevent eavesdropping or modification of unencrypted transmissions. Safeguards used to control physical access to support infrastructure include, for example, locked wiring closets; disconnected or locked spare jacks; protection of cabling by conduit or cable trays; and wiretapping sensors.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.10.2"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.10.3",
                "class": "SP800-171",
                "title": "Escort visitors and monitor visitor activity.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.10.3"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.10.3"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.10.3_smt",
                        "name": "statement",
                        "prose": "Escort visitors and monitor visitor activity.",
                        "parts": []
                    },
                    {
                        "id": "c3.10.3_gdn",
                        "name": "guidance",
                        "prose": "Individuals with permanent physical access authorization credentials are not considered visitors. Audit logs can be used to monitor visitor activity.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.10.3"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.10.4",
                "class": "SP800-171",
                "title": "Maintain audit logs of physical access.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.10.4"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.10.4"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.10.4_smt",
                        "name": "statement",
                        "prose": "Maintain audit logs of physical access.",
                        "parts": []
                    },
                    {
                        "id": "c3.10.4_gdn",
                        "name": "guidance",
                        "prose": "Organizations have flexibility in the types of audit logs employed. Audit logs can be procedural (e.g., a written log of individuals accessing the facility and when such access occurred), automated (e.g., capturing ID provided by a PIV card), or some combination thereof. Physical access points can include facility access points, interior access points to systems or system components requiring supplemental access controls, or both. Components of systems (e.g., workstations, notebook computers) may be in areas designated as publicly accessible with organizations safeguarding access to such devices.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.10.4"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.10.5",
                "class": "SP800-171",
                "title": "Control and manage physical access devices.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.10.5"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.10.5"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.10.5_smt",
                        "name": "statement",
                        "prose": "Control and manage physical access devices.",
                        "parts": []
                    },
                    {
                        "id": "c3.10.5_gdn",
                        "name": "guidance",
                        "prose": "Physical access devices include, for example, keys, locks, combinations, and card readers.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.10.5"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.10.6",
                "class": "SP800-171",
                "title": "Enforce safeguarding measures for CUI at alternate work sites",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.10.6"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.10.6"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.10.6_smt",
                        "name": "statement",
                        "prose": "Enforce safeguarding measures for CUI at alternate work sites",
                        "parts": []
                    },
                    {
                        "id": "c3.10.6_gdn",
                        "name": "guidance",
                        "prose": "Alternate work sites may include, for example, government facilities or private residences of employees. Organizations may define different security requirements for specific alternate work sites or types of sites depending on the work-related activities conducted at those sites.\\n\\nNIST Special Publications 800-46 and 800-114 provide guidance on enterprise and user security when teleworking.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.10.6"
                            }
                        ]
                    }
                ]
            }
          ] 
        },
        {
          "id": "c3.11",
          "class": "family",
          "title": "Risk Assessment",
          "controls": [
            {
                "id": "c3.11.1",
                "class": "SP800-171",
                "title": "Periodically assess the risk to organizational operations (including mission, functions, image, or reputation), organizational assets, and individuals, resulting from the operation of organizational systems and the associated processing, storage, or transmission of CUI.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.11.1"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.11.1"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.11.1_smt",
                        "name": "statement",
                        "prose": "Periodically assess the risk to organizational operations (including mission, functions, image, or reputation), organizational assets, and individuals, resulting from the operation of organizational systems and the associated processing, storage, or transmission of CUI.",
                        "parts": []
                    },
                    {
                        "id": "c3.11.1_gdn",
                        "name": "guidance",
                        "prose": "Clearly defined system boundaries are a prerequisite for effective risk assessments. Such risk assessments consider threats, vulnerabilities, likelihood, and impact to organizational operations, organizational assets, and individuals based on the operation and use of organizational systems. Risk assessments also consider risk from external parties (e.g., service providers, contractors operating systems on behalf of the organization, individuals accessing organizational systems, outsourcing entities). Risk assessments, either formal or informal, can be conducted at the organization level, the mission or business process level, or the system level, and at any phase in the system development life cycle.\\n\\nNIST Special Publication 800-30 provides guidance on conducting risk assessments.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.11.1"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.11.2",
                "class": "SP800-171",
                "title": "Scan for vulnerabilities in organizational systems and applications periodically and when new vulnerabilities affecting those systems and applications are identified.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.11.2"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.11.2"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.11.2_smt",
                        "name": "statement",
                        "prose": "Scan for vulnerabilities in organizational systems and applications periodically and when new vulnerabilities affecting those systems and applications are identified.",
                        "parts": []
                    },
                    {
                        "id": "c3.11.2_gdn",
                        "name": "guidance",
                        "prose": "Organizations determine the required vulnerability scanning for all system components, ensuring that potential sources of vulnerabilities such as networked printers, scanners, and copiers are not overlooked. The vulnerabilities to be scanned are readily updated as new vulnerabilities are discovered, announced, and scanning methods developed. This process ensures that potential vulnerabilities in the system are identified and addressed as quickly as possible. Vulnerability analyses for custom software applications may require additional approaches such as static analysis, dynamic analysis, binary analysis, or a hybrid of the three approaches. Organizations can employ these analysis approaches in source code reviews and in a variety of tools (e.g., static analysis tools, web-based application scanners, binary analyzers) and in source code reviews. Vulnerability scanning includes, for example: scanning for patch levels; scanning for functions, ports, protocols, and services that should not be accessible to users or devices; and scanning for improperly configured or incorrectly operating information flow control mechanisms.\\n\\nTo facilitate interoperability, organizations consider using products that are Security Content Automated Protocol (SCAP)-validated, scanning tools that express vulnerabilities in the Common Vulnerabilities and Exposures (CVE) naming convention, and that use the Open Vulnerability Assessment Language (OVAL) to determine the presence of vulnerabilities. Sources for vulnerability information include the Common Weakness Enumeration (CWE) listing and the National Vulnerability Database (NVD).\\n\\nSecurity assessments, such as red team exercises, provide additional sources of potential vulnerabilities for which to scan. Organizations also consider using scanning tools that express vulnerability impact by the Common Vulnerability Scoring System (CVSS). In certain situations, the nature of the vulnerability scanning may be more intrusive or the system component that is the subject of the scanning may contain highly sensitive information. Privileged access authorization to selected system components facilitates thorough vulnerability scanning and protects the sensitive nature of such scanning.\\n\\nNIST Special Publication 800-40 provides guidance on vulnerability management.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.11.2"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.11.3",
                "class": "SP800-171",
                "title": "Remediate vulnerabilities in accordance with risk assessments.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.11.3"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.11.3"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.11.3_smt",
                        "name": "statement",
                        "prose": "Remediate vulnerabilities in accordance with risk assessments.",
                        "parts": []
                    },
                    {
                        "id": "c3.11.3_gdn",
                        "name": "guidance",
                        "prose": "Vulnerabilities discovered, for example, via the scanning conducted in response to 3.11.2, are remediated with consideration of the related assessment of risk. The consideration of risk influences the prioritization of remediation efforts and the level of effort to be expended in the remediation for specific vulnerabilities.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.11.3"
                            }
                        ]
                    }
                ]
            }
          ] 
        },
        {
          "id": "c3.12",
          "class": "family",
          "title": "Risk Assessment",
          "controls": [
            {
                "id": "c3.12.1",
                "class": "SP800-171",
                "title": "Periodically assess the security controls in organizational systems to determine if the controls are effective in their application.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.12.1"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.12.1"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.12.1_smt",
                        "name": "statement",
                        "prose": "Periodically assess the security controls in organizational systems to determine if the controls are effective in their application.",
                        "parts": []
                    },
                    {
                        "id": "c3.12.1_gdn",
                        "name": "guidance",
                        "prose": "Organizations assess security controls in organizational systems and the environments in which those systems operate as part of the system development life cycle. Security controls are the safeguards or countermeasures organizations implement to satisfy security requirements. By assessing the implemented security controls, organizations determine if the security safeguards or countermeasures are in place and operating as intended. Security control assessments ensure that information security is built into organizational systems; identify weaknesses and deficiencies early in the development process; provide essential information needed to make risk-based decisions; and ensure compliance to vulnerability mitigation procedures. Assessments are conducted on the implemented security controls as documented in system security plans.\\n\\nSecurity assessment reports document assessment results in sufficient detail as deemed necessary by organizations, to determine the accuracy and completeness of the reports and whether the security controls are implemented correctly, operating as intended, and producing the desired outcome with respect to meeting security requirements. Security assessment results are provided to the individuals or roles appropriate for the types of assessments being conducted.\\n\\nOrganizations ensure that security assessment results are current, relevant to the determination of security control effectiveness, and obtained with the appropriate level of assessor independence. Organizations can choose to use other types of assessment activities such as vulnerability scanning and system monitoring to maintain the security posture of systems during the life cycle. NIST Special Publication 800-53A provides guidance on developing security assessment plans and for conducting assessments.\\n\\nNIST Special Publication 800-53 provides guidance on security and privacy controls for systems and organizations.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.12.1"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.12.2",
                "class": "SP800-171",
                "title": "Develop and implement plans of action designed to correct deficiencies and reduce or eliminate vulnerabilities in organizational systems.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.12.2"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.12.2"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.12.2_smt",
                        "name": "statement",
                        "prose": "Develop and implement plans of action designed to correct deficiencies and reduce or eliminate vulnerabilities in organizational systems.",
                        "parts": []
                    },
                    {
                        "id": "c3.12.2_gdn",
                        "name": "guidance",
                        "prose": "The plan of action is a key document in the information security program. Organizations develop plans of action that describe how any unimplemented security requirements will be met and how any planned mitigations will be implemented. Organizations can document the system security plan and plan of action as separate or combined documents and in any chosen format.\\n\\nFederal agencies may consider the submitted system security plans and plans of action as critical inputs to an overall risk management decision to process, store, or transmit CUI on a system hosted by a nonfederal organization and whether it is advisable to pursue an agreement or contract with the nonfederal organization.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.12.2"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.12.3",
                "class": "SP800-171",
                "title": "Monitor security controls on an ongoing basis to ensure the continued effectiveness of the controls.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.12.3"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.12.3"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.12.3_smt",
                        "name": "statement",
                        "prose": "Monitor security controls on an ongoing basis to ensure the continued effectiveness of the controls.",
                        "parts": []
                    },
                    {
                        "id": "c3.12.3_gdn",
                        "name": "guidance",
                        "prose": "Continuous monitoring programs facilitate ongoing awareness of threats, vulnerabilities, and information security to support organizational risk management decisions. The terms continuous and ongoing imply that organizations assess and analyze security controls and information security- related risks at a frequency sufficient to support risk-based decisions. The results of continuous monitoring programs generate appropriate risk response actions by organizations. Providing access to security information on a continuing basis through reports or dashboards gives organizational officials the capability to make more effective and timely risk management decisions.\\n\\nAutomation supports more frequent updates to hardware, software, firmware inventories, and other system information. Effectiveness is further enhanced when continuous monitoring outputs are formatted to provide information that is specific, measurable, actionable, relevant, and timely. Monitoring requirements, including the need for specific monitoring, may also be referenced in other requirements.\\n\\nNIST Special Publication 800-137 provides guidance on continuous monitoring.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.12.3"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.12.4",
                "class": "SP800-171",
                "title": "Develop, document, and periodically update system security plans that describe system boundaries, system environments of operation, how security requirements are implemented, and the relationships with or connections to other systems.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.12.4"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.12.4"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.12.4_smt",
                        "name": "statement",
                        "prose": "Develop, document, and periodically update system security plans that describe system boundaries, system environments of operation, how security requirements are implemented, and the relationships with or connections to other systems.26",
                        "parts": []
                    },
                    {
                        "id": "c3.12.4_gdn",
                        "name": "guidance",
                        "prose": "System security plans relate security requirements to a set of security controls. System security plans also describe, at a high level, how the security controls meet those security requirements, but do not provide detailed, technical descriptions of the specific design or implementation of the controls. Security plans contain sufficient information to enable a design and implementation that is unambiguously compliant with the intent of the plans and subsequent determinations of risk if the plan is implemented as intended. Security plans need not be single documents; the plans can be a collection of various documents including documents that already exist. Effective security plans make extensive use of references to policies, procedures, and additional documents (e.g., design and implementation specifications) where more detailed information can be obtained. This reduces the documentation requirements associated with security programs and maintains security-related information in other established management/operational areas related to enterprise architecture, system development life cycle, systems engineering, and acquisition.\\n\\nFederal agencies may consider the submitted system security plans and plans of action as critical inputs to an overall risk management decision to process, store, or transmit CUI on a system hosted by a nonfederal organization and whether it is advisable to pursue an agreement or contract with the nonfederal organization.\\n\\nNIST Special Publication 800-18 provides guidance on developing security plans.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.12.4"
                            }
                        ]
                    }
                ]
            }
          ] 
        },
        {
          "id": "c3.13",
          "class": "family",
          "title": "System and Communications Protection",
          "controls": [
            {
                "id": "c3.13.1",
                "class": "SP800-171",
                "title": "Monitor, control, and protect communications (i.e., information transmitted or received by organizational systems) at the external boundaries and key internal boundaries of organizational systems.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.13.1"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.13.1"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.13.1_smt",
                        "name": "statement",
                        "prose": "Monitor, control, and protect communications (i.e., information transmitted or received by organizational systems) at the external boundaries and key internal boundaries of organizational systems.",
                        "parts": []
                    },
                    {
                        "id": "c3.13.1_gdn",
                        "name": "guidance",
                        "prose": "Communications can be monitored, controlled, and protected at boundary components and by restricting or prohibiting interfaces in organizational systems. Boundary components include, for example, gateways, routers, firewalls, guards, network-based malicious code analysis and virtualization systems, or encrypted tunnels implemented within a system security architecture (e.g., routers protecting firewalls or application gateways residing on protected subnetworks). Restricting or prohibiting interfaces in organizational systems includes, for example, restricting external web traffic to designated web servers within managed interfaces and prohibiting external traffic that appears to be spoofing internal addresses.\\n\\nOrganizations consider the shared nature of commercial telecommunications services in the implementation of security requirements associated with the use of such services. Commercial telecommunications services are commonly based on network components and consolidated management systems shared by all attached commercial customers, and may also include third party-provided access lines and other service elements. Such transmission services may represent sources of increased risk despite contract security provisions. NIST Special Publication 800-41 provides guidance on firewalls and firewall policy.\\n\\nNIST Special Publication 800-125 provides guidance on security for virtualization technologies.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.13.1"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.13.2",
                "class": "SP800-171",
                "title": "Employ architectural designs, software development techniques, and systems engineering principles that promote effective information security within organizational systems.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.13.2"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.13.2"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.13.2_smt",
                        "name": "statement",
                        "prose": "Employ architectural designs, software development techniques, and systems engineering principles that promote effective information security within organizational systems.",
                        "parts": []
                    },
                    {
                        "id": "c3.13.2_gdn",
                        "name": "guidance",
                        "prose": "Organizations apply systems security engineering principles to new development systems or systems undergoing major upgrades. For legacy systems, organizations apply systems security engineering principles to system upgrades and modifications to the extent feasible, given the current state of hardware, software, and firmware components within those systems. The application of systems security engineering concepts and principles helps to develop trustworthy, secure, and resilient systems and system components and reduce the susceptibility of organizations to disruptions, hazards, and threats. Examples of these concepts and principles include developing layered protections; establishing security policies, architecture, and controls as the foundation for design; incorporating security requirements into the system development life cycle; delineating physical and logical security boundaries; ensuring that developers are trained on how to build secure software; and performing threat modeling to identify use cases, threat agents, attack vectors and patterns, design patterns, and compensating controls needed to mitigate risk. Organizations that apply security engineering concepts and principles can facilitate the development of trustworthy, secure systems, system components, and system services; reduce risk to acceptable levels; and make informed risk-management decisions.\\n\\nNIST Special Publication 800-160 provides guidance on systems security engineering.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.13.2"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.13.3",
                "class": "SP800-171",
                "title": "Separate user functionality from system management functionality.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.13.3"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.13.3"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.13.3_smt",
                        "name": "statement",
                        "prose": "Separate user functionality from system management functionality.",
                        "parts": []
                    },
                    {
                        "id": "c3.13.3_gdn",
                        "name": "guidance",
                        "prose": "System management functionality includes, for example, functions necessary to administer databases, network components, workstations, or servers, and typically requires privileged user access. The separation of user functionality from system management functionality is physical or logical. Organizations can implement separation of system management functionality from user functionality by using different computers, different central processing units, different instances of operating systems, or different network addresses; virtualization techniques; or combinations of these or other methods, as appropriate. This type of separation includes, for example, web administrative interfaces that use separate authentication methods for users of any other system resources. Separation of system and user functionality may include isolating administrative interfaces on different domains and with additional access controls.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.13.3"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.13.4",
                "class": "SP800-171",
                "title": "Prevent unauthorized and unintended information transfer via shared system resources.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.13.4"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.13.4"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.13.4_smt",
                        "name": "statement",
                        "prose": "Prevent unauthorized and unintended information transfer via shared system resources.",
                        "parts": []
                    },
                    {
                        "id": "c3.13.4_gdn",
                        "name": "guidance",
                        "prose": "The control of information in shared system resources (e.g., registers, cache memory, main memory, hard disks) is also commonly referred to as object reuse and residual information protection. This requirement prevents information produced by the actions of prior users or roles (or the actions of processes acting on behalf of prior users or roles) from being available to any current users or roles (or current processes acting on behalf of current users or roles) that obtain access to shared system resources after those resources have been released back to the system. This requirement also applies to encrypted representations of information. This requirement does not address information remanence, which refers to residual representation of data that has been nominally deleted; covert channels (including storage or timing channels) where shared resources are manipulated to violate information flow restrictions; or components within systems for which there are only single users or roles.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.13.4"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.13.5",
                "class": "SP800-171",
                "title": "Implement subnetworks for publicly accessible system components that are physically or logically separated from internal networks.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.13.5"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.13.5"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.13.5_smt",
                        "name": "statement",
                        "prose": "Implement subnetworks for publicly accessible system components that are physically or logically separated from internal networks.",
                        "parts": []
                    },
                    {
                        "id": "c3.13.5_gdn",
                        "name": "guidance",
                        "prose": "Subnetworks that are physically or logically separated from internal networks are referred to as demilitarized zones (DMZs). DMZs are typically implemented with boundary control devices and techniques that include, for example, routers, gateways, firewalls, virtualization, or cloud-based technologies.\\n\\nNIST Special Publication 800-41 provides guidance on firewalls and firewall policy. NIST Special Publication 800-125 provides guidance on security for virtualization technologies.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.13.5"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.13.6",
                "class": "SP800-171",
                "title": "Deny network communications traffic by default and allow network communications traffic by exception (i.e., deny all, permit by exception).",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.13.6"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.13.6"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.13.6_smt",
                        "name": "statement",
                        "prose": "Deny network communications traffic by default and allow network communications traffic by exception (i.e., deny all, permit by exception).",
                        "parts": []
                    },
                    {
                        "id": "c3.13.6_gdn",
                        "name": "guidance",
                        "prose": "This requirement applies to inbound and outbound network communications traffic, both at the system boundary and at identified points within the system. A deny-all, permit-by-exception network communications traffic policy ensures that only those connections which are essential and approved are allowed.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.13.6"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.13.7",
                "class": "SP800-171",
                "title": "Prevent remote devices from simultaneously establishing non-remote connections with organizational systems and communicating via some other connection to resources in external networks (i.e., split tunneling).",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.13.7"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.13.7"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.13.7_smt",
                        "name": "statement",
                        "prose": "Prevent remote devices from simultaneously establishing non-remote connections with organizational systems and communicating via some other connection to resources in external networks (i.e., split tunneling).",
                        "parts": []
                    },
                    {
                        "id": "c3.13.7_gdn",
                        "name": "guidance",
                        "prose": "Split tunneling might be desirable by remote users to communicate with local system resources such as printers or file servers. However, split tunneling would allow unauthorized external connections, making the system more vulnerable to attack and to exfiltration of organizational information. This requirement is implemented in remote devices (e.g., notebook computers, tablets) through configuration settings to disable split tunneling in those devices, and by preventing configuration settings from being readily configurable by users. This requirement is implemented in the system by the detection of split tunneling (or of configuration settings that allow split tunneling) in the remote device, and by prohibiting the connection if the remote device is using split tunneling.\n  ",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.13.7"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.13.8",
                "class": "SP800-171",
                "title": "Implement cryptographic mechanisms to prevent unauthorized disclosure of CUI during transmission unless otherwise protected by alternative physical safeguards.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.13.8"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.13.8"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.13.8_smt",
                        "name": "statement",
                        "prose": "Implement cryptographic mechanisms to prevent unauthorized disclosure of CUI during transmission unless otherwise protected by alternative physical safeguards.",
                        "parts": []
                    },
                    {
                        "id": "c3.13.8_gdn",
                        "name": "guidance",
                        "prose": "This requirement applies to internal and external networks and any system components that can transmit information including, for example, servers, notebook computers, desktop computers, mobile devices, printers, copiers, scanners, and facsimile machines. Communication paths outside the physical protection of a controlled boundary are susceptible to interception and modification. Organizations relying on commercial providers offering transmission services as commodity services rather than as fully dedicated services (i.e., services which can be highly specialized to individual customer needs), may find it difficult to obtain the necessary assurances regarding the implementation of needed safeguards for transmission confidentiality. In such situations, organizations determine what types of confidentiality services are available in standard, commercial telecommunication service packages. If it is infeasible or impractical to obtain the necessary safeguards and assurances of the effectiveness of the safeguards through appropriate contracting vehicles, organizations implement compensating safeguards or explicitly accept the additional risk. An example of an alternative physical safeguard is a protected distribution system (PDS) where the distribution medium is protected against electronic or physical intercept, thereby ensuring the confidentiality of the information being transmitted.\\n\\nSee NIST Cryptographic Standards.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.13.8"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.13.9",
                "class": "SP800-171",
                "title": "Terminate network connections associated with communications sessions at the end of the sessions or after a defined period of inactivity.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.13.9"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.13.9"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.13.9_smt",
                        "name": "statement",
                        "prose": "Terminate network connections associated with communications sessions at the end of the sessions or after a defined period of inactivity.",
                        "parts": []
                    },
                    {
                        "id": "c3.13.9_gdn",
                        "name": "guidance",
                        "prose": "This requirement applies to internal and external networks. Terminating network connections associated with communications sessions include, for example, de-allocating associated TCP/IP address or port pairs at the operating system level, or de-allocating networking assignments at the application level if multiple application sessions are using a single, operating system-level network connection. Time periods of user inactivity may be established by organizations and include, for example, time periods by type of network access or for specific network accesses.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.13.9"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.13.10",
                "class": "SP800-171",
                "title": "Establish and manage cryptographic keys for cryptography employed in organizational systems.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.13.10"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.13.10"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.13.10_smt",
                        "name": "statement",
                        "prose": "Establish and manage cryptographic keys for cryptography employed in organizational systems.",
                        "parts": []
                    },
                    {
                        "id": "c3.13.10_gdn",
                        "name": "guidance",
                        "prose": "Cryptographic key management and establishment can be performed using manual procedures or mechanisms supported by manual procedures. Organizations define key management requirements in accordance with applicable federal laws, Executive Orders, directives, regulations, policies, and standards, specifying appropriate options, levels, and parameters.\\n\\nNIST Special Publications 800-56 and 800-57 provide guidance on cryptographic key maintenance.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.13.10"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.13.11",
                "class": "SP800-171",
                "title": "Employ FIPS-validated cryptography when used to protect the confidentiality of CUI.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.13.11"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.13.11"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.13.11_smt",
                        "name": "statement",
                        "prose": "Employ FIPS-validated cryptography when used to protect the confidentiality of CUI.",
                        "parts": []
                    },
                    {
                        "id": "c3.13.11_gdn",
                        "name": "guidance",
                        "prose": "Cryptography can be employed to support many security solutions including, for example, the protection of controlled unclassified information, the provision of digital signatures, and the enforcement of information separation when authorized individuals have the necessary clearances for such information but lack the necessary formal access approvals. Cryptography can also be used to support random number generation and hash generation. Generally applicable cryptographic standards include FIPS-validated cryptography and NSA-approved cryptography. This control does not impose any requirements on organizations to use cryptography. However, if cryptography is required based on other security requirements, organizations define each type of cryptographic use and the type of cryptography required (e.g., FIPS-validated cryptography).\\n\\nSee NIST Cryptographic Standards; NIST Cryptographic Module Validation Program; NIST Cryptographic Algorithm Validation Program.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.13.11"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.13.12",
                "class": "SP800-171",
                "title": "Prohibit remote activation of collaborative computing devices and provide indication of devices in use to users present at the device.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.13.12"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.13.12"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.13.12_smt",
                        "name": "statement",
                        "prose": "Prohibit remote activation 27 of collaborative computing devices and provide indication of devices in use to users present at the device.",
                        "parts": []
                    },
                    {
                        "id": "c3.13.12_gdn",
                        "name": "guidance",
                        "prose": "Collaborative computing devices include, for example, networked white boards, cameras, and microphones. Indication of use includes, for example, signals to users when collaborative computing devices are activated. Dedicated video conferencing systems, which rely on one of the participants calling or connecting to the other party to activate the video conference, are excluded.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.13.12"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.13.13",
                "class": "SP800-171",
                "title": "Control and monitor the use of mobile code.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.13.13"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.13.13"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.13.13_smt",
                        "name": "statement",
                        "prose": "Control and monitor the use of mobile code.",
                        "parts": []
                    },
                    {
                        "id": "c3.13.13_gdn",
                        "name": "guidance",
                        "prose": "Mobile code technologies include, for example, Java, JavaScript, ActiveX, Postscript, PDF, Shockwave movies, Flash animations, and VBScript. Decisions regarding the use of mobile code in organizational systems are based on the potential for the code to cause damage to the systems if used maliciously. Usage restrictions and implementation guidance apply to the selection and use of mobile code installed on servers and mobile code downloaded and executed on individual workstations, notebook computers, and devices (e.g., smart phones). Mobile code policy and procedures address controlling or preventing the development, acquisition, or introduction of unacceptable mobile code in systems, including, for example, requiring mobile code to be digitally signed by a trusted source.\\n\\nNIST Special Publication 800-28 provides guidance on mobile code.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.13.13"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.13.14",
                "class": "SP800-171",
                "title": "Control and monitor the use of Voice over Internet Protocol (VoIP) technologies.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.13.14"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.13.14"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.13.14_smt",
                        "name": "statement",
                        "prose": "Control and monitor the use of Voice over Internet Protocol (VoIP) technologies.",
                        "parts": []
                    },
                    {
                        "id": "c3.13.14_gdn",
                        "name": "guidance",
                        "prose": "VoIP has different requirements, features, functionality, availability, and service limitations when compared with Plain Old Telephone Service (POTS) (i.e., the standard telephone service that most homes use). In contrast, other telephone services are based on high-speed, digital communications lines, such as Integrated Services Digital Network (ISDN) and Fiber Distributed Data Interface (FDDI). The main distinctions between POTS and non-POTS services are speed and bandwidth. To address the threats associated with VoIP, usage restrictions and implementation guidelines are based on the potential for the VoIP technology to cause damage to the system if it is used maliciously. Threats to VoIP are similar to those inherent with any Internet-based application.\\n\\nNIST Special Publication 800-58 provides guidance on Voice Over IP Systems.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.13.14"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.13.15",
                "class": "SP800-171",
                "title": "Protect the authenticity of communications sessions.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.13.15"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.13.15"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.13.15_smt",
                        "name": "statement",
                        "prose": "Protect the authenticity of communications sessions.",
                        "parts": []
                    },
                    {
                        "id": "c3.13.15_gdn",
                        "name": "guidance",
                        "prose": "Authenticity protection includes, for example, protecting against man-in-the-middle attacks, session hijacking, and the insertion of false information into communications sessions. This requirement addresses communications protection at the session versus packet level (e.g., sessions in service- oriented architectures providing web-based services) and establishes grounds for confidence at both ends of communications sessions in ongoing identities of other parties and in the validity of information transmitted.\\n\\nNIST Special Publications 800-52, 800-77, 800-95, and 800-113 provide guidance on secure communications sessions.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.13.15"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.13.16",
                "class": "SP800-171",
                "title": "Protect the confidentiality of CUI at rest.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.13.16"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.13.16"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.13.16_smt",
                        "name": "statement",
                        "prose": "Protect the confidentiality of CUI at rest.",
                        "parts": []
                    },
                    {
                        "id": "c3.13.16_gdn",
                        "name": "guidance",
                        "prose": "Information at rest refers to the state of information when it is not in process or in transit and is located on storage devices as specific components of systems. The focus of protection at rest is not on the type of storage device or the frequency of access but rather the state of the information. Organizations can use different mechanisms to achieve confidentiality protections, including the use of cryptographic mechanisms and file share scanning. Organizations may also employ other safeguards including, for example, secure off-line storage in lieu of online storage when adequate protection of information at rest cannot otherwise be achieved or continuous monitoring to identify malicious code at rest.\\n\\nSee NIST Cryptographic Standards.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.13.16"
                            }
                        ]
                    }
                ]
            }
          ] 
        },
        {
          "id": "c3.14",
          "class": "family",
          "title": "System and Information Integrity",
          "controls": [
            {
                "id": "c3.14.1",
                "class": "SP800-171",
                "title": "Identify, report, and correct system flaws in a timely manner.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.14.1"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.14.1"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.14.1_smt",
                        "name": "statement",
                        "prose": "Identify, report, and correct system flaws in a timely manner.",
                        "parts": []
                    },
                    {
                        "id": "c3.14.1_gdn",
                        "name": "guidance",
                        "prose": "Organizations identify systems that are affected by announced software and firmware flaws including potential vulnerabilities resulting from those flaws, and report this information to designated personnel with information security responsibilities. Security-relevant updates include, for example, patches, service packs, hot fixes, and anti-virus signatures. Organizations also address flaws discovered during security assessments, continuous monitoring, incident response activities, and system error handling. Organizations can take advantage of available resources such as the Common Weakness Enumeration (CWE) or Common Vulnerabilities and Exposures (CVE) databases in remediating flaws discovered in organizational systems.\\n\\nOrganization-defined time periods for updating security-relevant software and firmware may vary based on a variety of factors including, for example, the criticality of the update (i.e., severity of the vulnerability related to the discovered flaw). Some types of flaw remediation may require more testing than other types of remediation. NIST Special Publication 800-40 provides guidance on patch management technologies.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.14.1"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.14.2",
                "class": "SP800-171",
                "title": "Provide protection from malicious code at designated locations within organizational systems.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.14.2"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.14.2"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.14.2_smt",
                        "name": "statement",
                        "prose": "Provide protection from malicious code at designated locations within organizational systems.",
                        "parts": []
                    },
                    {
                        "id": "c3.14.2_gdn",
                        "name": "guidance",
                        "prose": "Designated locations include system entry and exit points which may include, for example, firewalls, remote-access servers, workstations, electronic mail servers, web servers, proxy servers, notebook computers, and mobile devices. Malicious code includes, for example, viruses, worms, Trojan horses, and spyware. Malicious code can be encoded in various formats (e.g., UUENCODE, Unicode), contained within compressed or hidden files, or hidden in files using techniques such as steganography. Malicious code can be inserted into systems in a variety of ways including, for example, web accesses, electronic mail, electronic mail attachments, and portable storage devices. Malicious code insertions occur through the exploitation of system vulnerabilities.\\n\\nMalicious code protection mechanisms include, for example, anti-virus signature definitions and reputation-based technologies. A variety of technologies and methods exist to limit or eliminate the effects of malicious code. Pervasive configuration management and comprehensive software integrity controls may be effective in preventing execution of unauthorized code. In addition to commercial off-the-shelf software, malicious code may also be present in custom-built software. This could include, for example, logic bombs, back doors, and other types of cyber-attacks that could affect organizational missions/business functions. Traditional malicious code protection mechanisms cannot always detect such code. In these situations, organizations rely instead on other safeguards including, for example, secure coding practices, configuration management and control, trusted procurement processes, and monitoring practices to help ensure that software does not perform functions other than the functions intended.\\n\\nNIST Special Publication 800-83 provides guidance on malware incident prevention.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.14.2"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.14.3",
                "class": "SP800-171",
                "title": "Monitor system security alerts and advisories and take action in response.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.14.3"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.14.3"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.14.3_smt",
                        "name": "statement",
                        "prose": "Monitor system security alerts and advisories and take action in response.",
                        "parts": []
                    },
                    {
                        "id": "c3.14.3_gdn",
                        "name": "guidance",
                        "prose": "There are many publicly available sources of system security alerts and advisories. The United States Computer Emergency Readiness Team (US-CERT) generates security alerts and advisories to maintain situational awareness across the federal government and in nonfederal organizations. Software vendors, subscription services, and relevant industry information sharing and analysis centers (ISACs) may also provide security alerts and advisories. Examples of response actions include notifying relevant external organizations, for example, external mission/business partners, supply chain partners, external service providers, and peer or supporting organizations.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.14.3"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.14.4",
                "class": "SP800-171",
                "title": "Update malicious code protection mechanisms when new releases are available.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.14.4"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.14.4"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.14.4_smt",
                        "name": "statement",
                        "prose": "Update malicious code protection mechanisms when new releases are available.",
                        "parts": []
                    },
                    {
                        "id": "c3.14.4_gdn",
                        "name": "guidance",
                        "prose": "Malicious code protection mechanisms include, for example, anti-virus signature definitions and reputation-based technologies. A variety of technologies and methods exist to limit or eliminate the effects of malicious code. Pervasive configuration management and comprehensive software integrity controls may be effective in preventing execution of unauthorized code. In addition to commercial off-the-shelf software, malicious code may also be present in custom-built software. This could include, for example, logic bombs, back doors, and other types of cyber-attacks that could affect organizational missions/business functions. Traditional malicious code protection mechanisms cannot always detect such code. In these situations, organizations rely instead on other safeguards including, for example, secure coding practices, configuration management and control, trusted procurement processes, and monitoring practices to help ensure that software does not perform functions other than the functions intended.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.14.4"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.14.5",
                "class": "SP800-171",
                "title": "Perform periodic scans of organizational systems and real-time scans of files from external sources as files are downloaded, opened, or executed.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.14.5"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.14.5"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.14.5_smt",
                        "name": "statement",
                        "prose": "Perform periodic scans of organizational systems and real-time scans of files from external sources as files are downloaded, opened, or executed.",
                        "parts": []
                    },
                    {
                        "id": "c3.14.5_gdn",
                        "name": "guidance",
                        "prose": "Periodic scans of organizational systems and real-time scans of files from external sources can detect malicious code. Malicious code can be encoded in various formats (e.g., UUENCODE, Unicode), contained within compressed or hidden files, or hidden in files using techniques such as steganography. Malicious code can be inserted into systems in a variety of ways including, for example, web accesses, electronic mail, electronic mail attachments, and portable storage devices. Malicious code insertions occur through the exploitation of system vulnerabilities.\\n\\nMalicious code protection mechanisms include, for example, anti-virus signature definitions and reputation-based technologies. Many technologies and methods exist to limit or eliminate the effects of malicious code. Pervasive configuration management and comprehensive software integrity controls may be effective in preventing execution of unauthorized code. In addition to commercial off-the-shelf software, malicious code may also be present in custom-built software. This could include, for example, logic bombs, back doors, and other types of cyber-attacks that could affect organizational missions/business functions. Traditional malicious code protection mechanisms cannot always detect such code. In these situations, organizations rely instead on other safeguards including, for example, secure coding practices, configuration management and control, trusted procurement processes, and monitoring practices to help ensure that software does not perform functions other than the functions intended.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.14.5"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.14.6",
                "class": "SP800-171",
                "title": "Monitor organizational systems, including inbound and outbound communications traffic, to detect attacks and indicators of potential attacks.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.14.6"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.14.6"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.14.6_smt",
                        "name": "statement",
                        "prose": "Monitor organizational systems, including inbound and outbound communications traffic, to detect attacks and indicators of potential attacks.",
                        "parts": []
                    },
                    {
                        "id": "c3.14.6_gdn",
                        "name": "guidance",
                        "prose": "System monitoring includes external and internal monitoring. External monitoring includes the observation of events occurring at the system boundary (i.e., part of perimeter defense and boundary protection). Internal monitoring includes the observation of events occurring within the system. Organizations can monitor systems, for example, by observing audit record activities in real time or by observing other system aspects such as access patterns, characteristics of access, and other actions. The monitoring objectives may guide determination of the events. System monitoring capability is achieved through a variety of tools and techniques (e.g., intrusion detection systems, intrusion prevention systems, malicious code protection software, scanning tools, audit record monitoring software, network monitoring software). Strategic locations for monitoring devices include, for example, selected perimeter locations and near server farms supporting critical applications, with such devices being employed at managed system interfaces. The granularity of monitoring information collected is based on organizational monitoring objectives and the capability of systems to support such objectives.\\n\\nSystem monitoring is an integral part of continuous monitoring and incident response programs. Output from system monitoring serves as input to continuous monitoring and incident response programs. A network connection is any connection with a device that communicates through a network (e.g., local area network, Internet). A remote connection is any connection with a device communicating through an external network (e.g., the Internet). Local, network, and remote connections can be either wired or wireless.\\n\\nUnusual or unauthorized activities or conditions related to inbound and outbound communications traffic include, for example, internal traffic that indicates the presence of malicious code in systems or propagating among system components, the unauthorized exporting of information, or signaling to external systems. Evidence of malicious code is used to identify potentially compromised systems or system components. System monitoring requirements, including the need for specific types of system monitoring, may be referenced in other requirements.\\n\\nNIST Special Publication 800-94 provides guidance on intrusion detection and prevention systems.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.14.6"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "c3.14.7",
                "class": "SP800-171",
                "title": "Identify unauthorized use of organizational systems.",
                "parameters": [],
                "properties": [
                    {
                        "name": "label",
                        "value": "3.14.7"
                    },
                    {
                        "name": "sort-id",
                        "value": "3.14.7"
                    }
                ],
                "links": [],
                "parts": [
                    {
                        "id": "c3.14.7_smt",
                        "name": "statement",
                        "prose": "Identify unauthorized use of organizational systems.",
                        "parts": []
                    },
                    {
                        "id": "c3.14.7_gdn",
                        "name": "guidance",
                        "prose": "System monitoring can detect unauthorized use of organizational systems. System monitoring includes external and internal monitoring. System monitoring is an integral part of continuous monitoring and incident response programs; it is achieved through a variety of tools and techniques (e.g., intrusion detection systems, intrusion prevention systems, malicious code protection software, scanning tools, audit record monitoring software, network monitoring software). Output from system monitoring serves as input to continuous monitoring and incident response programs.\\n\\nUnusual or unauthorized activities or conditions related to inbound and outbound communications traffic include, for example, internal traffic that indicates the presence of malicious code in systems or propagating among system components, the unauthorized exporting of information, or signaling to external systems. Evidence of malicious code is used to identify potentially compromised systems or system components. System monitoring requirements, including the need for specific types of system monitoring, may be referenced in other requirements.\\n\\nNIST Special Publication 800-94 provides guidance on intrusion detection and prevention systems.",
                        "links": [
                            {
                                "href": "#ID",
                                "rel": "reference",
                                "text": "3.14.7"
                            }
                        ]
                    }
                ]
            }
          ]
        }
      ],
      "back-matter": {
        "resources": [
          {
            "id": "ref001",
            "title": "5 C.F.R. 731.106",
            "citation": {
              "text": "Code of Federal Regulations, Title 5, Administrative Personnel, Section 731.106, Designation of Public Trust Positions and Investigative Requirements (5 C.F.R. 731.106)."
            },
            "rlinks": [
              {
                "href": "http://www.gpo.gov/fdsys/granule/CFR-2012-title5-vol2/CFR-2012-title5-vol2-sec731-106/content-detail.html"
              }
            ]
          },
          {
            "id": "ref002",
            "title": "C.F.R. Part 5 Subpart C (5 C.F.R. 930.301)",
            "citation": {
              "text": "C.F.R. Part 5 Subpart C (5 C.F.R. 930.301)"
            },
            "rlinks": [
              {
                "href": "http://www.gpo.gov/fdsys/granule/CFR-2009-title5-vol2/CFR-2009-title5-vol2-sec930-301/content-detail.html"
              }
            ]
          },
          {
            "id": "ref003",
            "title": "CNSS Policy 15",
            "citation": {
              "text": "CNSS Policy 15"
            },
            "rlinks": [
              {
                "href": "https://www.cnss.gov/policies.html"
              }
            ]
          },
          {
            "id": "ref004",
            "title": "DoD Information Assurance Vulnerability Alerts",
            "citation": {
              "text": "DoD Information Assurance Vulnerability Alerts"
            }
          },
          {
            "id": "ref005",
            "title": "DoD Instruction 5200.39",
            "citation": {
              "text": "DoD Instruction 5200.39"
            },
            "rlinks": [
              {
                "href": "http://www.dtic.mil/whs/directives/corres/ins1.html"
              }
            ]
          },
          {
            "id": "ref006",
            "title": "DoD Instruction 8551.01",
            "citation": {
              "text": "DoD Instruction 8551.01"
            },
            "rlinks": [
              {
                "href": "http://www.dtic.mil/whs/directives/corres/ins1.html"
              }
            ]
          },
          {
            "id": "ref007",
            "title": "DoD Instruction 8552.01",
            "citation": {
              "text": "DoD Instruction 8552.01"
            },
            "rlinks": [
              {
                "href": "http://www.dtic.mil/whs/directives/corres/ins1.html"
              }
            ]
          },
          {
            "id": "ref008",
            "title": "Executive Order 13587",
            "citation": {
              "text": "Executive Order 13587"
            },
            "rlinks": [
              {
                "href": "http://www.whitehouse.gov/the-press-office/2011/10/07/executive-order-13587-structural-reforms-improve-security-classified-net"
              }
            ]
          },
          {
            "id": "ref009",
            "title": "Federal Acquisition Regulation",
            "citation": {
              "text": "Federal Acquisition Regulation"
            },
            "rlinks": [
              {
                "href": "https://acquisition.gov/far"
              }
            ]
          },
          {
            "id": "ref010",
            "title": "Federal Continuity Directive 1",
            "citation": {
              "text": "Federal Continuity Directive 1"
            },
            "rlinks": [
              {
                "href": "http://www.fema.gov/pdf/about/offices/fcd1.pdf"
              }
            ]
          },
          {
            "id": "ref011",
            "title": "FICAM Roadmap and Implementation Guidance",
            "citation": {
              "text": "FICAM Roadmap and Implementation Guidance"
            },
            "rlinks": [
              {
                "href": "http://www.idmanagement.gov/documents/ficam-roadmap-and-implementation-guidance"
              }
            ]
          },
          {
            "id": "ref012",
            "title": "FIPS Publication 140",
            "citation": {
              "text": "FIPS Publication 140"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsFIPS.html"
              }
            ]
          },
          {
            "id": "ref013",
            "title": "FIPS Publication 140-2",
            "citation": {
              "text": "FIPS Publication 140-2"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsFIPS.html#140-2"
              }
            ]
          },
          {
            "id": "ref014",
            "title": "FIPS Publication 197",
            "citation": {
              "text": "FIPS Publication 197"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsFIPS.html#197"
              }
            ]
          },
          {
            "id": "ref015",
            "title": "FIPS Publication 199",
            "citation": {
              "text": "FIPS Publication 199"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsFIPS.html#199"
              }
            ]
          },
          {
            "id": "ref016",
            "title": "FIPS Publication 200",
            "citation": {
              "text": "FIPS Publication 200"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsFIPS.html#200"
              }
            ]
          },
          {
            "id": "ref017",
            "title": "FIPS Publication 201",
            "citation": {
              "text": "FIPS Publication 201"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsFIPS.html#201"
              }
            ]
          },
          {
            "id": "ref018",
            "title": "HSPD-12",
            "citation": {
              "text": "HSPD-12"
            },
            "rlinks": [
              {
                "href": "http://www.dhs.gov/homeland-security-presidential-directive-12"
              }
            ]
          },
          {
            "id": "ref019",
            "title": "HSPD 7",
            "citation": {
              "text": "HSPD 7"
            },
            "rlinks": [
              {
                "href": "http://www.fas.org/irp/offdocs/nspd/hspd-7.html"
              }
            ]
          },
          {
            "id": "ref020",
            "title": "http://capec.mitre.org",
            "citation": {
              "text": "http://capec.mitre.org"
            },
            "rlinks": [
              {
                "href": "http://capec.mitre.org"
              }
            ]
          },
          {
            "id": "ref021",
            "title": "http://checklists.nist.gov",
            "citation": {
              "text": "http://checklists.nist.gov"
            },
            "rlinks": [
              {
                "href": "http://checklists.nist.gov"
              }
            ]
          },
          {
            "id": "ref022",
            "title": "http://csrc.nist.gov/cryptval",
            "citation": {
              "text": "http://csrc.nist.gov/cryptval"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/cryptval"
              }
            ]
          },
          {
            "id": "ref023",
            "title": "http://csrc.nist.gov/groups/STM/cmvp/index.html",
            "citation": {
              "text": "http://csrc.nist.gov/groups/STM/cmvp/index.html"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/groups/STM/cmvp/index.html"
              }
            ]
          },
          {
            "id": "ref024",
            "title": "http://cve.mitre.org",
            "citation": {
              "text": "http://cve.mitre.org"
            },
            "rlinks": [
              {
                "href": "http://cve.mitre.org"
              }
            ]
          },
          {
            "id": "ref025",
            "title": "http://cwe.mitre.org",
            "citation": {
              "text": "http://cwe.mitre.org"
            },
            "rlinks": [
              {
                "href": "http://cwe.mitre.org"
              }
            ]
          },
          {
            "id": "ref026",
            "title": "http://fips201ep.cio.gov",
            "citation": {
              "text": "http://fips201ep.cio.gov"
            },
            "rlinks": [
              {
                "href": "http://fips201ep.cio.gov"
              }
            ]
          },
          {
            "id": "ref027",
            "title": "http://idmanagement.gov",
            "citation": {
              "text": "http://idmanagement.gov"
            },
            "rlinks": [
              {
                "href": "http://idmanagement.gov"
              }
            ]
          },
          {
            "id": "ref028",
            "title": "http://nvd.nist.gov",
            "citation": {
              "text": "http://nvd.nist.gov"
            },
            "rlinks": [
              {
                "href": "http://nvd.nist.gov"
              }
            ]
          },
          {
            "id": "ref029",
            "title": "http://www.acquisition.gov/far",
            "citation": {
              "text": "http://www.acquisition.gov/far"
            },
            "rlinks": [
              {
                "href": "http://www.acquisition.gov/far"
              }
            ]
          },
          {
            "id": "ref030",
            "title": "http://www.cnss.gov",
            "citation": {
              "text": "http://www.cnss.gov"
            },
            "rlinks": [
              {
                "href": "http://www.cnss.gov"
              }
            ]
          },
          {
            "id": "ref031",
            "title": "http://www.dhs.gov/telecommunications-service-priority-tsp",
            "citation": {
              "text": "http://www.dhs.gov/telecommunications-service-priority-tsp"
            },
            "rlinks": [
              {
                "href": "http://www.dhs.gov/telecommunications-service-priority-tsp"
              }
            ]
          },
          {
            "id": "ref032",
            "title": "http://www.niap-ccevs.org",
            "citation": {
              "text": "http://www.niap-ccevs.org"
            },
            "rlinks": [
              {
                "href": "http://www.niap-ccevs.org"
              }
            ]
          },
          {
            "id": "ref033",
            "title": "http://www.nsa.gov",
            "citation": {
              "text": "http://www.nsa.gov"
            },
            "rlinks": [
              {
                "href": "http://www.nsa.gov"
              }
            ]
          },
          {
            "id": "ref034",
            "title": "http://www.nsa.gov/ia/mitigation_guidance/media_destruction_guidance/index.shtml",
            "citation": {
              "text": "http://www.nsa.gov/ia/mitigation_guidance/media_destruction_guidance/index.shtml"
            },
            "rlinks": [
              {
                "href": "http://www.nsa.gov/ia/mitigation_guidance/media_destruction_guidance/index.shtml"
              }
            ]
          },
          {
            "id": "ref035",
            "title": "http://www.omb.gov",
            "citation": {
              "text": "http://www.omb.gov"
            },
            "rlinks": [
              {
                "href": "http://www.omb.gov"
              }
            ]
          },
          {
            "id": "ref036",
            "title": "http://www.us-cert.gov",
            "citation": {
              "text": "http://www.us-cert.gov"
            },
            "rlinks": [
              {
                "href": "http://www.us-cert.gov"
              }
            ]
          },
          {
            "id": "ref037",
            "title": "ICD 704",
            "citation": {
              "text": "ICD 704"
            },
            "rlinks": [
              {
                "href": "http://www.dni.gov/index.php/intelligence-community/ic-policies-reports/intelligence-community-directives"
              }
            ]
          },
          {
            "id": "ref038",
            "title": "ICD 705",
            "citation": {
              "text": "ICD 705"
            },
            "rlinks": [
              {
                "href": "http://www.dni.gov/index.php/intelligence-community/ic-policies-reports/intelligence-community-directives"
              }
            ]
          },
          {
            "id": "ref039",
            "title": "ISO/IEC 15408",
            "citation": {
              "text": "ISO/IEC 15408"
            },
            "rlinks": [
              {
                "href": "http://www.iso.org/iso/iso_catalog/catalog_tc/catalog_detail.htm?csnumber=50341"
              }
            ]
          },
          {
            "id": "ref040",
            "title": "National Communications Systems Directive 3-10",
            "citation": {
              "text": "National Communications Systems Directive 3-10"
            }
          },
          {
            "id": "ref041",
            "title": "National Infrastructure Protection Plan",
            "citation": {
              "text": "National Infrastructure Protection Plan"
            },
            "rlinks": [
              {
                "href": "https://www.dhs.gov/national-infrastructure-protection-plan"
              }
            ]
          },
          {
            "id": "ref042",
            "title": "National Strategy for Trusted Identities in Cyberspace",
            "citation": {
              "text": "National Strategy for Trusted Identities in Cyberspace"
            },
            "rlinks": [
              {
                "href": "http://www.nist.gov/nstic"
              }
            ]
          },
          {
            "id": "ref043",
            "title": "NIST Interagency Report 7622",
            "citation": {
              "text": "NIST Interagency Report 7622"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsNISTIRs.html#NIST-IR-7622"
              }
            ]
          },
          {
            "id": "ref044",
            "title": "NIST Special Publication 800-100",
            "document-ids": [
              {
                "type": "doi",
                "identifier": "10.6028/NIST.SP.800-100"
              }
            ],
            "citation": {
              "text": "NIST Special Publication 800-100"
            },
            "rlinks": [
              {
                "href": "https://doi.org/10.6028/NIST.SP.800-100"
              }
            ]
          },
          {
            "id": "ref045",
            "title": "NIST Special Publication 800-111",
            "document-ids": [
              {
                "type": "doi",
                "identifier": "10.6028/NIST.SP.800-111"
              }
            ],
            "citation": {
              "text": "NIST Special Publication 800-111"
            },
            "rlinks": [
              {
                "href": "https://doi.org/10.6028/NIST.SP.800-111"
              }
            ]
          },
          {
            "id": "ref046",
            "title": "NIST Special Publication 800-113",
            "document-ids": [
              {
                "type": "doi",
                "identifier": "10.6028/NIST.SP.800-113"
              }
            ],
            "citation": {
              "text": "NIST Special Publication 800-113"
            },
            "rlinks": [
              {
                "href": "https://doi.org/10.6028/NIST.SP.800-113"
              }
            ]
          },
          {
            "id": "ref047",
            "title": "NIST Special Publication 800-114 Rev. 1",
            "document-ids": [
              {
                "type": "doi",
                "identifier": "10.6028/NIST.SP.800-114r1"
              }
            ],
            "citation": {
              "text": "NIST Special Publication 800-114 Rev. 1"
            },
            "rlinks": [
              {
                "href": "https://doi.org/10.6028/NIST.SP.800-114r1"
              }
            ]
          },
          {
            "id": "ref048",
            "title": "NIST Special Publication 800-115",
            "document-ids": [
              {
                "type": "doi",
                "identifier": "10.6028/NIST.SP.800-115"
              }
            ],
            "citation": {
              "text": "NIST Special Publication 800-115"
            },
            "rlinks": [
              {
                "href": "https://doi.org/10.6028/NIST.SP.800-115"
              }
            ]
          },
          {
            "id": "ref049",
            "title": "NIST Special Publication 800-116 Rev. 1",
            "document-ids": [
              {
                "type": "doi",
                "identifier": "10.6028/NIST.SP.800-116r1"
              }
            ],
            "citation": {
              "text": "NIST Special Publication 800-116 Rev. 1"
            },
            "rlinks": [
              {
                "href": "https://doi.org/10.6028/NIST.SP.800-116r1"
              }
            ]
          },
          {
            "id": "ref050",
            "title": "NIST Special Publication 800-12 Rev. 1",
            "document-ids": [
              {
                "type": "doi",
                "identifier": "10.6028/NIST.SP.800-12r1"
              }
            ],
            "citation": {
              "text": "NIST Special Publication 800-12 Rev. 1"
            },
            "rlinks": [
              {
                "href": "https://doi.org/10.6028/NIST.SP.800-12r1"
              }
            ]
          },
          {
            "id": "ref051",
            "title": "NIST Special Publication 800-121",
            "citation": {
              "text": "NIST Special Publication 800-121"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-121"
              }
            ]
          },
          {
            "id": "ref052",
            "title": "NIST Special Publication 800-124",
            "citation": {
              "text": "NIST Special Publication 800-124"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-124"
              }
            ]
          },
          {
            "id": "ref053",
            "title": "NIST Special Publication 800-128",
            "citation": {
              "text": "NIST Special Publication 800-128"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-128"
              }
            ]
          },
          {
            "id": "ref054",
            "title": "NIST Special Publication 800-137",
            "citation": {
              "text": "NIST Special Publication 800-137"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-137"
              }
            ]
          },
          {
            "id": "ref055",
            "title": "NIST Special Publication 800-147",
            "citation": {
              "text": "NIST Special Publication 800-147"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-147"
              }
            ]
          },
          {
            "id": "ref056",
            "title": "NIST Special Publication 800-155",
            "citation": {
              "text": "NIST Special Publication 800-155"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-155"
              }
            ]
          },
          {
            "id": "ref057",
            "title": "NIST Special Publication 800-16",
            "citation": {
              "text": "NIST Special Publication 800-16"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-16"
              }
            ]
          },
          {
            "id": "ref058",
            "title": "NIST Special Publication 800-161",
            "citation": {
              "text": "NIST Special Publication 800-161"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-161"
              }
            ]
          },
          {
            "id": "ref059",
            "title": "NIST Special Publication 800-164",
            "citation": {
              "text": "NIST Special Publication 800-164"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-164"
              }
            ]
          },
          {
            "id": "ref060",
            "title": "NIST Special Publication 800-18",
            "citation": {
              "text": "NIST Special Publication 800-18"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-18"
              }
            ]
          },
          {
            "id": "ref061",
            "title": "NIST Special Publication 800-23",
            "citation": {
              "text": "NIST Special Publication 800-23"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-23"
              }
            ]
          },
          {
            "id": "ref062",
            "title": "NIST Special Publication 800-27",
            "citation": {
              "text": "NIST Special Publication 800-27"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-27"
              }
            ]
          },
          {
            "id": "ref063",
            "title": "NIST Special Publication 800-28",
            "citation": {
              "text": "NIST Special Publication 800-28"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-28"
              }
            ]
          },
          {
            "id": "ref064",
            "title": "NIST Special Publication 800-30",
            "citation": {
              "text": "NIST Special Publication 800-30"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-30"
              }
            ]
          },
          {
            "id": "ref065",
            "title": "NIST Special Publication 800-32",
            "citation": {
              "text": "NIST Special Publication 800-32"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-32"
              }
            ]
          },
          {
            "id": "ref066",
            "title": "NIST Special Publication 800-34",
            "citation": {
              "text": "NIST Special Publication 800-34"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-34"
              }
            ]
          },
          {
            "id": "ref067",
            "title": "NIST Special Publication 800-35",
            "citation": {
              "text": "NIST Special Publication 800-35"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-35"
              }
            ]
          },
          {
            "id": "ref068",
            "title": "NIST Special Publication 800-36",
            "citation": {
              "text": "NIST Special Publication 800-36"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-36"
              }
            ]
          },
          {
            "id": "ref069",
            "title": "NIST Special Publication 800-37",
            "citation": {
              "text": "NIST Special Publication 800-37"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-37"
              }
            ]
          },
          {
            "id": "ref070",
            "title": "NIST Special Publication 800-39",
            "citation": {
              "text": "NIST Special Publication 800-39"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-39"
              }
            ]
          },
          {
            "id": "ref071",
            "title": "NIST Special Publication 800-40",
            "citation": {
              "text": "NIST Special Publication 800-40"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-40"
              }
            ]
          },
          {
            "id": "ref072",
            "title": "NIST Special Publication 800-41",
            "citation": {
              "text": "NIST Special Publication 800-41"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-41"
              }
            ]
          },
          {
            "id": "ref073",
            "title": "NIST Special Publication 800-45",
            "citation": {
              "text": "NIST Special Publication 800-45"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-45"
              }
            ]
          },
          {
            "id": "ref074",
            "title": "NIST Special Publication 800-46",
            "citation": {
              "text": "NIST Special Publication 800-46"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-46"
              }
            ]
          },
          {
            "id": "ref075",
            "title": "NIST Special Publication 800-47",
            "citation": {
              "text": "NIST Special Publication 800-47"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-47"
              }
            ]
          },
          {
            "id": "ref076",
            "title": "NIST Special Publication 800-48",
            "citation": {
              "text": "NIST Special Publication 800-48"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-48"
              }
            ]
          },
          {
            "id": "ref077",
            "title": "NIST Special Publication 800-50",
            "citation": {
              "text": "NIST Special Publication 800-50"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-50"
              }
            ]
          },
          {
            "id": "ref078",
            "title": "NIST Special Publication 800-52",
            "citation": {
              "text": "NIST Special Publication 800-52"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-52"
              }
            ]
          },
          {
            "id": "ref079",
            "title": "NIST Special Publication 800-53",
            "citation": {
              "text": "NIST Special Publication 800-53"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-53"
              }
            ]
          },
          {
            "id": "ref080",
            "title": "NIST Special Publication 800-53A",
            "citation": {
              "text": "NIST Special Publication 800-53A"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-53A"
              }
            ]
          },
          {
            "id": "ref081",
            "title": "NIST Special Publication 800-55",
            "citation": {
              "text": "NIST Special Publication 800-55"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-55"
              }
            ]
          },
          {
            "id": "ref082",
            "title": "NIST Special Publication 800-56",
            "citation": {
              "text": "NIST Special Publication 800-56"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-56"
              }
            ]
          },
          {
            "id": "ref083",
            "title": "NIST Special Publication 800-57",
            "citation": {
              "text": "NIST Special Publication 800-57"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-57"
              }
            ]
          },
          {
            "id": "ref084",
            "title": "NIST Special Publication 800-58",
            "citation": {
              "text": "NIST Special Publication 800-58"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-58"
              }
            ]
          },
          {
            "id": "ref085",
            "title": "NIST Special Publication 800-60",
            "citation": {
              "text": "NIST Special Publication 800-60"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-60"
              }
            ]
          },
          {
            "id": "ref086",
            "title": "NIST Special Publication 800-61",
            "citation": {
              "text": "NIST Special Publication 800-61"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-61"
              }
            ]
          },
          {
            "id": "ref087",
            "title": "NIST Special Publication 800-63",
            "citation": {
              "text": "NIST Special Publication 800-63"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-63"
              }
            ]
          },
          {
            "id": "ref088",
            "title": "NIST Special Publication 800-64",
            "citation": {
              "text": "NIST Special Publication 800-64"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-64"
              }
            ]
          },
          {
            "id": "ref089",
            "title": "NIST Special Publication 800-65",
            "citation": {
              "text": "NIST Special Publication 800-65"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-65"
              }
            ]
          },
          {
            "id": "ref090",
            "title": "NIST Special Publication 800-70",
            "citation": {
              "text": "NIST Special Publication 800-70"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-70"
              }
            ]
          },
          {
            "id": "ref091",
            "title": "NIST Special Publication 800-73",
            "citation": {
              "text": "NIST Special Publication 800-73"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-73"
              }
            ]
          },
          {
            "id": "ref092",
            "title": "NIST Special Publication 800-76",
            "citation": {
              "text": "NIST Special Publication 800-76"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-76"
              }
            ]
          },
          {
            "id": "ref093",
            "title": "NIST Special Publication 800-77",
            "citation": {
              "text": "NIST Special Publication 800-77"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-77"
              }
            ]
          },
          {
            "id": "ref094",
            "title": "NIST Special Publication 800-78",
            "citation": {
              "text": "NIST Special Publication 800-78"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-78"
              }
            ]
          },
          {
            "id": "ref095",
            "title": "NIST Special Publication 800-81",
            "citation": {
              "text": "NIST Special Publication 800-81"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-81"
              }
            ]
          },
          {
            "id": "ref096",
            "title": "NIST Special Publication 800-83",
            "citation": {
              "text": "NIST Special Publication 800-83"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-83"
              }
            ]
          },
          {
            "id": "ref097",
            "title": "NIST Special Publication 800-84",
            "citation": {
              "text": "NIST Special Publication 800-84"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-84"
              }
            ]
          },
          {
            "id": "ref098",
            "title": "NIST Special Publication 800-88",
            "citation": {
              "text": "NIST Special Publication 800-88"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-88"
              }
            ]
          },
          {
            "id": "ref099",
            "title": "NIST Special Publication 800-92",
            "citation": {
              "text": "NIST Special Publication 800-92"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-92"
              }
            ]
          },
          {
            "id": "ref100",
            "title": "NIST Special Publication 800-94",
            "citation": {
              "text": "NIST Special Publication 800-94"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-94"
              }
            ]
          },
          {
            "id": "ref101",
            "title": "NIST Special Publication 800-95",
            "citation": {
              "text": "NIST Special Publication 800-95"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-95"
              }
            ]
          },
          {
            "id": "ref102",
            "title": "NIST Special Publication 800-97",
            "citation": {
              "text": "NIST Special Publication 800-97"
            },
            "rlinks": [
              {
                "href": "http://csrc.nist.gov/publications/PubsSPs.html#800-97"
              }
            ]
          },
          {
            "id": "ref103",
            "title": "NSTISSI No. 7003",
            "citation": {
              "text": "NSTISSI No. 7003"
            },
            "rlinks": [
              {
                "href": "http://www.cnss.gov/Assets/pdf/nstissi_7003.pdf"
              }
            ]
          },
          {
            "id": "ref104",
            "title": "OMB Circular A-130",
            "citation": {
              "text": "OMB Circular A-130"
            },
            "rlinks": [
              {
                "href": "http://www.whitehouse.gov/omb/circulars_a130_a130trans4"
              }
            ]
          },
          {
            "id": "ref105",
            "title": "OMB Memorandum 02-01",
            "citation": {
              "text": "OMB Memorandum 02-01"
            },
            "rlinks": [
              {
                "href": "http://www.whitehouse.gov/omb/memoranda_m02-01"
              }
            ]
          },
          {
            "id": "ref106",
            "title": "OMB Memorandum 04-04",
            "citation": {
              "text": "OMB Memorandum 04-04"
            },
            "rlinks": [
              {
                "href": "http://www.whitehouse.gov/sites/default/files/omb/assets/omb/memoranda/fy04/m04-04.pdf"
              }
            ]
          },
          {
            "id": "ref107",
            "title": "OMB Memorandum 05-24",
            "citation": {
              "text": "OMB Memorandum 05-24"
            },
            "rlinks": [
              {
                "href": "http://www.whitehouse.gov/sites/default/files/omb/assets/omb/memoranda/fy2005/m05-24.pdf"
              }
            ]
          },
          {
            "id": "ref108",
            "title": "OMB Memorandum 06-16",
            "citation": {
              "text": "OMB Memorandum 06-16"
            },
            "rlinks": [
              {
                "href": "http://www.whitehouse.gov/sites/default/files/omb/assets/omb/memoranda/fy2006/m06-16.pdf"
              }
            ]
          },
          {
            "id": "ref109",
            "title": "OMB Memorandum 07-11",
            "citation": {
              "text": "OMB Memorandum 07-11"
            },
            "rlinks": [
              {
                "href": "http://www.whitehouse.gov/sites/default/files/omb/assets/omb/memoranda/fy2007/m07-11.pdf"
              }
            ]
          },
          {
            "id": "ref110",
            "title": "OMB Memorandum 07-18",
            "citation": {
              "text": "OMB Memorandum 07-18"
            },
            "rlinks": [
              {
                "href": "http://www.whitehouse.gov/sites/default/files/omb/assets/omb/memoranda/fy2007/m07-18.pdf"
              }
            ]
          },
          {
            "id": "ref111",
            "title": "OMB Memorandum 08-22",
            "citation": {
              "text": "OMB Memorandum 08-22"
            },
            "rlinks": [
              {
                "href": "http://www.whitehouse.gov/sites/default/files/omb/assets/omb/memoranda/fy2008/m08-22.pdf"
              }
            ]
          },
          {
            "id": "ref112",
            "title": "OMB Memorandum 08-23",
            "citation": {
              "text": "OMB Memorandum 08-23"
            },
            "rlinks": [
              {
                "href": "http://www.whitehouse.gov/sites/default/files/omb/assets/omb/memoranda/fy2008/m08-23.pdf"
              }
            ]
          },
          {
            "id": "ref113",
            "title": "OMB Memorandum 10-06-2011",
            "citation": {
              "text": "OMB Memorandum 10-06-2011"
            }
          },
          {
            "id": "ref114",
            "title": "OMB Memorandum 11-11",
            "citation": {
              "text": "OMB Memorandum 11-11"
            },
            "rlinks": [
              {
                "href": "http://www.whitehouse.gov/sites/default/files/omb/memoranda/2011/m11-11.pdf"
              }
            ]
          },
          {
            "id": "ref115",
            "title": "OMB Memorandum 11-33",
            "citation": {
              "text": "OMB Memorandum 11-33"
            },
            "rlinks": [
              {
                "href": "http://www.whitehouse.gov/sites/default/files/omb/memoranda/2011/m11-33.pdf"
              }
            ]
          },
          {
            "id": "ref116",
            "title": "Personal Identity Verification (PIV) in Enterprise Physical Access Control System (E-PACS)",
            "citation": {
              "text": "Personal Identity Verification (PIV) in Enterprise Physical Access Control System (E-PACS)"
            }
          },
          {
            "id": "ref117",
            "title": "US-CERT Technical Cyber Security Alerts",
            "citation": {
              "text": "US-CERT Technical Cyber Security Alerts"
            },
            "rlinks": [
              {
                "href": "http://www.us-cert.gov/ncas/alerts"
              }
            ]
          },
          {
            "id": "resource-pdf-sp-800-53r4",
            "rlinks": [
              {
                "href": "https://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-53r4.pdf",
                "media-type": "application/pdf"
              }
            ]
          },
          {
            "id": "resource-doi-sp-800-53r4",
            "rlinks": [
              {
                "href": "http://dx.doi.org/10.6028/NIST.SP.800-53r4",
                "media-type": "application/pdf"
              }
            ]
          }
        ]
      }
    }
  }
