{
  "component-definition": {
    "uuid": "42f9d5bd-a61e-4f84-b7dd-d3f96490e515",
    "metadata": {
      "title": "BlackBerry Enterprise Mobility Server 2.x",
      "last-modified": "2022-06-12T20:17:27",
      "version": "2022-06-12T20:17:27",
      "oscal-version": "1.0.0",
      "parties": [
        {
          "uuid": "1970637a-3e7f-46d9-88e7-337e7e8919e0",
          "type": "organization",
          "name": "Example Organization"
        }
      ]
    },
    "components": [
      {
        "uuid": "9fd59f59-d141-4b03-8764-5c5a972a4dd0",
        "type": "software",
        "title": "BlackBerry Enterprise Mobility Server 2.x",
        "description": "BlackBerry Enterprise Mobility Server 2.x based on DOD SRG/STIG.",
        "responsible-roles": [
          {
            "role-id": "supplier",
            "party-uuids": [
              "1970637a-3e7f-46d9-88e7-337e7e8919e0"
            ]
          }
        ],
        "props": [],
        "control-implementations": [
          {
            "uuid": "8a15ee36-bdb6-4981-98ee-89214bd5bd6d",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ac-3.",
            "implemented-requirements": [
              {
                "uuid": "dd2766cd-5c64-48fd-9b97-55fc1c7fab76",
                "description": "The BlackBerry Enterprise Mobility Server (BEMS) must be configured to have at least one user in the following Administrator roles: Server primary administrator, auditor.",
                "control-id": "ac-3"
              }
            ]
          },
          {
            "uuid": "52563af2-5c76-4b76-9381-b2ea4a82bfdc",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ac-12.",
            "implemented-requirements": [
              {
                "uuid": "ead94184-62fb-4c55-b3fc-0db2b3bdeba3",
                "description": "The BlackBerry Enterprise Mobility Server (BEMS) must be configured with an inactivity timeout of 15 minutes or less.",
                "control-id": "ac-12"
              }
            ]
          },
          {
            "uuid": "2cf24adf-fea3-4615-9a4f-a8b65c1e2588",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ac-17.1.",
            "implemented-requirements": [
              {
                "uuid": "e8ffd9d3-dbf0-4453-ba7b-e826cc792fdb",
                "description": "If the BlackBerry Docs service is installed on the BlackBerry Enterprise Mobility Server (BEMS), it must be configured to enable audit logs.",
                "control-id": "ac-17.1"
              }
            ]
          },
          {
            "uuid": "de066dbe-69b5-48c1-94c8-857cdcaff829",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ac-17.2.",
            "implemented-requirements": [
              {
                "uuid": "e71f7a00-b1ef-4168-8667-bd0a114a21f0",
                "description": "If the BlackBerry Connect service is installed on the BlackBerry Enterprise Mobility Server (BEMS), it must be configured to enable SSL support for BlackBerry Proxy and use only DoD approved certificates.\nIf the BlackBerry Docs service is installed on the BlackBerry Enterprise Mobility Server (BEMS), it must be configured to use SSL for LDAP lookup to connect to the Office Web App Server (e.g., SharePoint).",
                "control-id": "ac-17.2"
              },
              {
                "uuid": "fc81be29-7643-4b63-934b-56ccb7f5c46e",
                "description": "The BlackBerry Enterprise Mobility Server (BEMS) must be configured to use HTTPS.\nIf the Mail service (Push Notifications support for BlackBerry Work) is installed on the BlackBerry Enterprise Mobility Server (BEMS), it must be configured to Enable SSL LDAP when using LDAP Lookup for users.\nIf the Mail service (Push Notifications support for BlackBerry Work) is installed on the BlackBerry Enterprise Mobility Server (BEMS), it must be configured to Enable SSL LDAP for certificate directory lookup.",
                "control-id": "ac-17.2"
              }
            ]
          },
          {
            "uuid": "ba62ef84-6b89-4770-8b24-6fa50dfa9a5f",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement au-9.",
            "implemented-requirements": [
              {
                "uuid": "7458bf9e-1b62-4ace-8480-da61b50d189f",
                "description": "The BlackBerry Enterprise Mobility Server (BEMS) must protect log information from any type of unauthorized read access.",
                "control-id": "au-9"
              },
              {
                "uuid": "fc9e13b0-afbe-475b-8266-ca1b44981675",
                "description": "The BlackBerry Enterprise Mobility Server (BEMS) must protect log information from unauthorized modification.",
                "control-id": "au-9"
              },
              {
                "uuid": "9f53bfcb-66ba-4cdc-ac7e-360723544740",
                "description": "The BlackBerry Enterprise Mobility Server (BEMS) must protect log information from unauthorized deletion.",
                "control-id": "au-9"
              }
            ]
          },
          {
            "uuid": "80658f2c-0501-48e4-84ad-5de50e4f8db1",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement cm-7.",
            "implemented-requirements": [
              {
                "uuid": "4efa1972-b444-446f-93ef-a6e42693fa7d",
                "description": "The BlackBerry Enterprise Mobility Server (BEMS) platform must be protected by a DoD-approved firewall.\nThe firewall protecting the BlackBerry Enterprise Mobility Server (BEMS) must be configured to restrict all network traffic to and from all addresses with the exception of ports, protocols, and IP address ranges required to support BEMS functions.\nThe firewall protecting the BlackBerry Enterprise Mobility Server (BEMS) must be configured so that only DoD-approved ports, protocols, and services are enabled. See the DoD Ports, Protocols, Services Management (PPSM) Category Assurance Levels (CAL) list for DoD-approved ports, protocols, and services.",
                "control-id": "cm-7"
              }
            ]
          },
          {
            "uuid": "2fa6fd8b-1c3a-4066-b99e-54a9adb1466c",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ia-2.",
            "implemented-requirements": [
              {
                "uuid": "5ca07c12-6994-430a-a866-017edbd0fa41",
                "description": "The BlackBerry Enterprise Mobility Server (BEMS) must be configured to use Windows Authentication for the database connection.\nIf the Mail service (Push Notifications support for BlackBerry Work) is installed on the BlackBerry Enterprise Mobility Server (BEMS), it must be configured to use Windows Authentication for the database connection.\nIf the Mail service (Push Notifications support for BlackBerry Work) is installed on the BlackBerry Enterprise Mobility Server (BEMS), it must be configured to use Windows Integrated Authentication for the Exchange connection.\nIf the BlackBerry Connect service is installed on the BlackBerry Enterprise Mobility Server (BEMS), it must be configured to use Windows Authentication for the database connection.\nIf the BlackBerry Docs service is installed on the BlackBerry Enterprise Mobility Server (BEMS), it must be configured to use Windows Authentication for the database connection.\nIf the BlackBerry Docs service is installed on the BlackBerry Enterprise Mobility Server (BEMS), it must be configured to use NTLM authentication.",
                "control-id": "ia-2"
              }
            ]
          },
          {
            "uuid": "d5512aca-c3f1-44b6-9239-9b1927e86e6d",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-8.",
            "implemented-requirements": [
              {
                "uuid": "bcd844c7-051b-43d2-9d11-605d6944a66d",
                "description": "The BlackBerry Enterprise Mobility Server (BEMS) must protect the confidentiality and integrity of transmitted information through the use of an approved TLS version.\nThe BlackBerry Enterprise Mobility Server (BEMS) must remove all export ciphers to protect the confidentiality and integrity of transmitted information.",
                "control-id": "sc-8"
              }
            ]
          },
          {
            "uuid": "6c625d28-1e0e-445f-a569-b7ec9df9fd31",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-23.5.",
            "implemented-requirements": [
              {
                "uuid": "ff64ef07-4c1f-4447-98c0-bd94169beeb3",
                "description": "The BlackBerry Enterprise Mobility Server (BEMS) must be configured to use DoD certificates for SSL.",
                "control-id": "sc-23.5"
              }
            ]
          }
        ]
      }
    ]
  }
}