{
  "component-definition": {
    "uuid": "07853198-ea3b-48e9-9f31-08c82e1f4fda",
    "metadata": {
      "title": "Router Security Requirements Guide",
      "last-modified": "2022-06-12T20:17:27",
      "version": "2022-06-12T20:17:27",
      "oscal-version": "1.0.0",
      "parties": [
        {
          "uuid": "8cd1145e-489b-4bcb-b75d-1bb4c6601ac2",
          "type": "organization",
          "name": "Example Organization"
        }
      ]
    },
    "components": [
      {
        "uuid": "90d825b3-f2ce-4dba-8fd0-705da55eda2f",
        "type": "software",
        "title": "Router Security Requirements Guide",
        "description": "Router Security Requirements Guide based on DOD SRG/STIG.",
        "responsible-roles": [
          {
            "role-id": "supplier",
            "party-uuids": [
              "8cd1145e-489b-4bcb-b75d-1bb4c6601ac2"
            ]
          }
        ],
        "props": [],
        "control-implementations": [
          {
            "uuid": "33d60605-c1d2-4e3b-ac60-21a68e361c48",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ac-4.",
            "implemented-requirements": [
              {
                "uuid": "486fba1d-c848-401f-a513-2cee555f5554",
                "description": "The router must be configured to enforce approved authorizations for controlling the flow of information within the network based on organization-defined information flow control policies.\nThe BGP router must be configured to reject inbound route advertisements for any Bogon prefixes.\nThe BGP router must be configured to reject inbound route advertisements for any prefixes belonging to the local autonomous system (AS).\nThe BGP router must be configured to reject inbound route advertisements from a customer edge (CE) router for prefixes that are not allocated to that customer.\nThe BGP router must be configured to reject outbound route advertisements for any prefixes that do not belong to any customers or the local autonomous system (AS).\nThe Multicast Source Discovery Protocol (MSDP) router must be configured to filter received source-active multicast advertisements for any undesirable multicast groups and sources.\nThe Multicast Source Discovery Protocol (MSDP) router must be configured to filter source-active multicast advertisements to external MSDP peers to avoid global visibility of local-only multicast sources and groups.\nThe MSDP router must be configured to limit the amount of source-active messages it accepts on per-peer basis.",
                "control-id": "ac-4"
              },
              {
                "uuid": "0054215c-17de-4adf-82fa-4d67bcc17787",
                "description": "The router must be configured to disable the auxiliary port unless it is connected to a secured modem providing encryption and authentication.\nThe perimeter router must be configured to enforce approved authorizations for controlling the flow of information between interconnected networks in accordance with applicable policy.\nThe multicast router must be configured to disable Protocol Independent Multicast (PIM) on all interfaces that are not required to support multicast routing.\nThe multicast router must be configured to bind a Protocol Independent Multicast (PIM) neighbor filter to interfaces that have PIM enabled.\nThe multicast edge router must be configured to establish boundaries for administratively scoped multicast traffic.\nThe router must be configured to have all inactive interfaces disabled.\nThe perimeter router must be configured to protect an enclave connected to an alternate gateway by using an inbound filter that only permits packets with destination addresses within the sites address space.\nThe perimeter router must be configured to not be a Border Gateway Protocol (BGP) peer to an alternate gateway service provider.\nThe perimeter router must be configured to not redistribute static routes to an alternate gateway service provider into BGP or an IGP peering with the NIPRNet or to other autonomous systems.\nThe out-of-band management (OOBM) gateway router must be configured to have separate IGP instances for the managed network and management network.\nThe out-of-band management (OOBM) gateway router must be configured to not redistribute routes between the management network routing domain and the managed network routing domain.\nThe multicast Rendezvous Point (RP) router must be configured to filter Protocol Independent Multicast (PIM) Register messages received from the Designated Router (DR) for any undesirable multicast groups and sources.\nThe multicast Rendezvous Point (RP) router must be configured to filter Protocol Independent Multicast (PIM) Join messages received from the Designated Router (DR) for any undesirable multicast groups.",
                "control-id": "ac-4"
              }
            ]
          },
          {
            "uuid": "690789e9-b90d-411d-a056-ea1fff1a4224",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ac-4.8.",
            "implemented-requirements": [
              {
                "uuid": "b06b060d-09dc-4905-8ca3-4e1659c3ee9b",
                "description": "The BGP router must be configured to reject route advertisements from BGP peers that do not list their autonomous system (AS) number as the first AS in the AS_PATH attribute.\nThe BGP router must be configured to reject route advertisements from CE routers with an originating AS in the AS_PATH attribute that does not belong to that customer.",
                "control-id": "ac-4.8"
              }
            ]
          },
          {
            "uuid": "ee122bc7-f0fb-4a66-8fb2-f53c365e66a4",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ac-4.17.",
            "implemented-requirements": [
              {
                "uuid": "60296d62-6cac-4e12-bf01-b3d85dd808d4",
                "description": "The router must be configured to implement message authentication for all control plane protocols.\nThe BGP router must be configured to use a unique key for each autonomous system (AS) that it peers with.\nThe router must be configured to use keys with a duration not exceeding 180 days for authenticating routing protocol messages.",
                "control-id": "ac-4.17"
              }
            ]
          },
          {
            "uuid": "b39f49e1-3f01-40a7-a7b7-a5004349dad4",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement au-3.",
            "implemented-requirements": [
              {
                "uuid": "54b08269-4fdc-4b00-a634-281a2a07e633",
                "description": "The router must be configured to produce audit records containing information to establish where the events occurred.",
                "control-id": "au-3"
              },
              {
                "uuid": "b8de28c7-0f02-4e4c-aff4-74aa5236495b",
                "description": "The router must be configured to log all packets that have been dropped.",
                "control-id": "au-3"
              },
              {
                "uuid": "2f13e83f-5a34-4622-a48d-87b110752660",
                "description": "The router must be configured to produce audit records containing information to establish the source of the events.",
                "control-id": "au-3"
              }
            ]
          },
          {
            "uuid": "1af0b247-648b-461b-919b-b1a989f23b20",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement cm-6.",
            "implemented-requirements": [
              {
                "uuid": "e5518d00-1554-4d89-8844-2aa612531679",
                "description": "The multicast Designated Router (DR) must be configured to increase the shortest-path tree (SPT) threshold or set it to infinity to minimalize source-group (S, G) state within the multicast topology where Any Source Multicast (ASM) is deployed.\nThe BGP router must be configured to use its loopback address as the source address for iBGP peering sessions.\nThe MPLS router must be configured to use its loopback address as the source address for LDP peering sessions.\nThe MPLS router must be configured to synchronize IGP and LDP to minimize packet loss when an IGP adjacency is established prior to LDP peers completing label exchange.\nThe MPLS router must be configured to have TTL Propagation disabled.\nThe PE router must be configured to have each Virtual Routing and Forwarding (VRF) instance bound to the appropriate physical or logical interfaces to maintain traffic separation between all MPLS L3VPNs.\nThe PE router must be configured to have each Virtual Routing and Forwarding (VRF) instance with the appropriate Route Target (RT).\nThe PE router must be configured to have each VRF with the appropriate Route Distinguisher (RD).\nThe PE router providing MPLS Virtual Private Wire Service (VPWS) must be configured to have the appropriate virtual circuit identification (VC ID) for each attachment circuit.\nThe PE router providing Virtual Private LAN Services (VPLS) must be configured to have all attachment circuits defined to the virtual forwarding instance (VFI) with the globally unique VPN ID assigned for each customer VLAN.\nThe PE router must be configured to enforce the split-horizon rule for all pseudowires within a Virtual Private LAN Services (VPLS) bridge domain.\nThe Multicast Source Discovery Protocol (MSDP) router must be configured to use its loopback address as the source address when originating MSDP traffic.\nThe router must be configured in accordance with the security configuration settings based on DoD security configuration or implementation guidance, including STIGs, NSA configuration guides, CTOs, and DTMs.\nThe router must be configured to implement message authentication for all control plane protocols.\nThe BGP router must be configured to use a unique key for each autonomous system (AS) that it peers with.\nThe router must be configured to use keys with a duration not exceeding 180 days for authenticating routing protocol messages.\nThe router must be configured to advertise a hop limit of at least 32 in Router Advertisement messages for IPv6 stateless auto-configuration deployments.\nThe router must not be configured to use IPv6 Site Local Unicast addresses.\nThe perimeter router must be configured to suppress Router Advertisements on all external IPv6-enabled interfaces.",
                "control-id": "cm-6"
              }
            ]
          },
          {
            "uuid": "ea7dcb44-d8bb-4822-a6c6-687de181890a",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement cm-7.",
            "implemented-requirements": [
              {
                "uuid": "078a1da1-5a7d-41cb-a6b4-f4ab04abdfb0",
                "description": "The router must be configured to have all non-essential capabilities disabled.",
                "control-id": "cm-7"
              }
            ]
          },
          {
            "uuid": "9a16405d-9c59-4992-8ecd-dfc36f9e6a54",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ia-3.",
            "implemented-requirements": [
              {
                "uuid": "bea9600e-a3e4-493d-94f5-517cf43ad522",
                "description": "The PE router providing MPLS Layer 2 Virtual Private Network (L2VPN) services must be configured to authenticate targeted Label Distribution Protocol (LDP) sessions used to exchange virtual circuit (VC) information using a FIPS-approved message authentication code algorithm.\nThe Multicast Source Discovery Protocol (MSDP) router must be configured to authenticate all received MSDP packets.",
                "control-id": "ia-3"
              }
            ]
          },
          {
            "uuid": "e5404f2f-9c9d-4a19-aa5f-af1cc776bcca",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ia-7.",
            "implemented-requirements": [
              {
                "uuid": "e78825c6-e821-49c0-b396-09bfa59db725",
                "description": "The router must be configured to use encryption for routing protocol authentication.\nThe router must be configured to authenticate all routing protocol messages using NIST-validated FIPS 198-1 message authentication code algorithm.",
                "control-id": "ia-7"
              }
            ]
          },
          {
            "uuid": "80dcabca-8da2-4343-9abd-3bc919289fc9",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-5.",
            "implemented-requirements": [
              {
                "uuid": "76a6ca02-f833-4310-9075-dc83e891fd17",
                "description": "The router must not be configured to have any zero-touch deployment feature enabled when connected to an operational network.\nThe router must be configured to protect against or limit the effects of denial-of-service (DoS) attacks by employing control plane protection.\nThe router must be configured to have Gratuitous ARP disabled on all external interfaces.\nThe router must be configured to have IP directed broadcast disabled on all interfaces.\nThe router must be configured to have Internet Control Message Protocol (ICMP) unreachable notifications disabled on all external interfaces.\nThe router must be configured to have Internet Control Message Protocol (ICMP) mask replies disabled on all external interfaces.\nThe router must be configured to have Internet Control Message Protocol (ICMP) redirects disabled on all external interfaces.\nThe BGP router must be configured to use the maximum prefixes feature to protect against route table flooding and prefix de-aggregation attacks.\nThe BGP router must be configured to limit the prefix size on any inbound route advertisement to /24 or the least significant prefixes issued to the customer.\nThe PE router must be configured to implement Internet Group Management Protocol (IGMP) or Multicast Listener Discovery (MLD) snooping for each Virtual Private LAN Services (VPLS) bridge domain.\nThe multicast Rendezvous Point (RP) router must be configured to limit the multicast forwarding cache so that its resources are not saturated by managing an overwhelming number of Protocol Independent Multicast (PIM) and Multicast Source Discovery Protocol (MSDP) source-active entries.\nThe multicast Rendezvous Point (RP) must be configured to rate limit the number of Protocol Independent Multicast (PIM) Register messages.\nThe multicast Designated Router (DR) must be configured to limit the number of mroute states resulting from Internet Group Management Protocol (IGMP) and Multicast Listener Discovery (MLD) Host Membership Reports.\nThe BGP router must be configured to enable the Generalized TTL Security Mechanism (GTSM).",
                "control-id": "sc-5"
              }
            ]
          },
          {
            "uuid": "4409d03b-f573-4213-b794-785e779d64d6",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-5.1.",
            "implemented-requirements": [
              {
                "uuid": "f8e3bb2a-67c7-4bff-a639-f26d42ad9648",
                "description": "The PE router must be configured to limit the number of MAC addresses it can learn for each Virtual Private LAN Services (VPLS) bridge domain.\nThe perimeter router must be configured to restrict it from accepting outbound IP packets that contain an illegitimate address in the source address field via egress filter or by enabling Unicast Reverse Path Forwarding (uRPF).",
                "control-id": "sc-5.1"
              }
            ]
          },
          {
            "uuid": "b4e17df1-87a1-40b0-9dda-e1af96360212",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-5.2.",
            "implemented-requirements": [
              {
                "uuid": "4ee5047e-e60c-405d-9e27-b78ac068da25",
                "description": "The MPLS router with RSVP-TE enabled must be configured with message pacing or refresh reduction to adjust maximum number of RSVP messages to an output queue based on the link speed and input queue size of adjacent core routers.\nThe PE router providing Virtual Private LAN Services (VPLS) must be configured to have traffic storm control thresholds on CE-facing interfaces.\nThe PE router must be configured to enforce a Quality-of-Service (QoS) policy to limit the effects of packet flooding denial-of-service (DoS) attacks.\nThe PE router must be configured to enforce a Quality-of-Service (QoS) policy in accordance with the QoS DoDIN Technical Profile.\nThe P router must be configured to enforce a Quality-of-Service (QoS) policy in accordance with the QoS GIG Technical Profile.",
                "control-id": "sc-5.2"
              }
            ]
          },
          {
            "uuid": "698ab1cf-1b9f-4f4c-9fb4-11f245e6adf0",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-7.",
            "implemented-requirements": [
              {
                "uuid": "5e006337-68cd-4817-b579-68888aa0144f",
                "description": "The router must be configured to restrict traffic destined to itself.\nThe router must be configured to drop all fragmented Internet Control Message Protocol (ICMP) packets destined to itself.\nThe perimeter router must be configured to filter traffic destined to the enclave in accordance with the guidelines contained in DoD Instruction 8551.1.\nThe perimeter router must be configured to filter ingress traffic at the external interface on an inbound direction.\nThe perimeter router must be configured to filter egress traffic at the internal interface on an inbound direction.\nThe BGP router must be configured to reject outbound route advertisements for any prefixes belonging to the IP core.\nThe PE router must be configured to block any traffic that is destined to IP core infrastructure.\nThe PE router must be configured with Unicast Reverse Path Forwarding (uRPF) loose mode enabled on all CE-facing interfaces..\nThe out-of-band management (OOBM) gateway must be configured to transport management traffic to the Network Operations Center (NOC) via dedicated circuit, MPLS/VPN service, or IPsec tunnel.\nThe out-of-band management (OOBM) gateway router must be configured to forward only authorized management traffic to the Network Operations Center (NOC).\nThe out-of-band management (OOBM) gateway router must be configured to block any traffic destined to itself that is not sourced from the OOBM network or the NOC.\nThe router must be configured to only permit management traffic that ingresses and egresses the OOBM interface.\nThe router providing connectivity to the NOC must be configured to forward all in-band management traffic via an IPsec tunnel.\nThe perimeter router must be configured to block all outbound management traffic.",
                "control-id": "sc-7"
              }
            ]
          },
          {
            "uuid": "4af46309-0eb7-497a-86cf-fb3347d0f5b3",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-7.5.",
            "implemented-requirements": [
              {
                "uuid": "3cfe3795-63d6-425d-bccb-326a7d96ca33",
                "description": "The perimeter router must be configured to deny network traffic by default and allow network traffic by exception.",
                "control-id": "sc-7.5"
              }
            ]
          },
          {
            "uuid": "2d8a69b4-8ffc-4d8b-8eaa-02f36c30a2eb",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-7.11.",
            "implemented-requirements": [
              {
                "uuid": "0d7c2d36-12da-4b7b-818a-7e6de407f644",
                "description": "The perimeter router must be configured to only allow incoming communications from authorized sources to be routed to authorized destinations.\nThe perimeter router must be configured to block inbound packets with source Bogon IP address prefixes.\nThe perimeter router must be configured to have Link Layer Discovery Protocols (LLDPs) disabled on all external interfaces.\nThe perimeter router must be configured to have Proxy ARP disabled on all external interfaces.\nThe multicast Designated Router (DR) must be configured to filter the Internet Group Management Protocol (IGMP) and Multicast Listener Discovery (MLD) Report messages to allow hosts to join only multicast groups that have been approved by the organization.\nThe multicast Designated Router (DR) must be configured to filter the Internet Group Management Protocol (IGMP) and Multicast Listener Discovery (MLD) Report messages to allow hosts to join a multicast group only from sources that have been approved by the organization.\nThe Multicast Source Discovery Protocol (MSDP) router must be configured to only accept MSDP packets from known MSDP peers.\nThe router must not be configured to have any feature enabled that calls home to the vendor.\nThe perimeter router must be configured to block all packets with any IP options.\nThe PE router must be configured to ignore or block all packets with any IP options.\nThe perimeter router must be configured to drop IPv6 undetermined transport packets.\nThe perimeter router must be configured drop IPv6 packets with a Routing Header type 0, 1, or 3255.\nThe perimeter router must be configured to drop IPv6 packets containing a Hop-by-Hop header with invalid option type values.\nThe perimeter router must be configured to drop IPv6 packets containing a Destination Option header with invalid option type values.\nThe perimeter router must be configured to drop IPv6 packets containing an extension header with the Endpoint Identification option.\nThe perimeter router must be configured to drop IPv6 packets containing the NSAP address option within Destination Option header.\nThe perimeter router must be configured to drop IPv6 packets containing a Hop-by-Hop or Destination Option extension header with an undefined option type.",
                "control-id": "sc-7.11"
              }
            ]
          },
          {
            "uuid": "07e3ba72-1bb6-45ea-9736-73473096bec8",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-7.18.",
            "implemented-requirements": [
              {
                "uuid": "d071f843-e818-4d2f-b44c-72379ddfc143",
                "description": "The router must be configured to fail securely in the event of an operational failure.",
                "control-id": "sc-7.18"
              }
            ]
          },
          {
            "uuid": "1237faef-d2aa-43a5-a7b5-ed445c5d9498",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-24.",
            "implemented-requirements": [
              {
                "uuid": "3a671817-5cd0-49a5-92d2-96ef6b7a391f",
                "description": "The router must be configured to stop forwarding traffic upon the failure of the following actions: system initialization, shutdown, or system abort.",
                "control-id": "sc-24"
              }
            ]
          }
        ]
      }
    ]
  }
}